[
  {
    "code": "130A",
    "corequisites": "ENGRMAE 91",
    "description": "Fundamental concepts; fluid statics; fluid dynamics; Bernoulli's equation; control-volume analysis; basic flow equations of conservation of mass, momentum, and energy; differential analysis; potential flow; viscous incompressible flow.",
    "design_units": 0,
    "prerequisites": "PHYSICS 7C and MATH 2D and MATH 2E and MATH 3D and (ENGRMAE 30 or ENGRCEE 30 or ENGR 30) and (ENGRMAE 80 or ENGRCEE 80 or ENGR 80). PHYSICS 7C with a grade of C- or better. MATH 2D with a grade of C- or better. MATH 2E with a grade of C- or better. MATH 3D with a grade of C- or better. ENGRMAE 30 with a grade of C- or better. ENGRCEE 30 with a grade of C- or better. ENGR 30 with a grade of C- or better. ENGRMAE 80 with a grade of C- or better. ENGRCEE 80 with a grade of C- or better. ENGR 80 with a grade of C- or better",
    "section": "ENGRMAE",
    "title": "Introduction to Fluid Mechanics",
    "units": 4
  },
  {
    "code": "223A",
    "corequisites": [],
    "description": "Introduction to the discretization of various types of partial differential equations (parabolic, elliptic, hyperbolic). Finite-volume discretization for one- and two-dimensional flows. Use of a two-dimensional elliptic procedure to predict sample laminar flows.",
    "design_units": 0,
    "prerequisites": "or corequisite: ENGRMAE 230A",
    "section": "ENGRMAE",
    "title": "Numerical Methods in Heat, Mass, and Momentum Transport (Laminar Flows) I",
    "units": 4
  },
  {
    "code": "223B",
    "corequisites": [],
    "description": "Introduction to turbulence. Reynolds-averaging of Navier-Stokes equations. Second-order closure of the average equations. Use of two-dimensional elliptic procedure to predict confined turbulent flows. Not offered every year.",
    "design_units": 0,
    "prerequisites": "ENGRMAE 223A",
    "section": "ENGRMAE",
    "title": "Numerical Methods in Heat, Mass, and Momentum II",
    "units": 4
  },
  {
    "code": 224,
    "corequisites": [],
    "description": "Fundamentals of transport phenomena in fluid (gas and liquid), solid, and nano systems. Conservation equations, fundamentals of diffusion, ion transport, dispersion in turbulent/laminar flows, absorption, differential/staged distillation, transport in membranes, and nano/microscale transport phenomena. Not offered every year.",
    "design_units": 0,
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Advanced Transport Phenomena",
    "units": 4
  },
  {
    "code": 80,
    "corequisites": [],
    "description": "Introduction to the kinematics and dynamics of particles and rigid bodies. The Newton-Euler, Work/Energy, and Impulse/Momentum methods are explored for ascertaining the dynamics of particles and rigid bodies. An engineering design problem using these fundamental principles is also undertaken.",
    "design_units": "0.5",
    "prerequisites": "MATH 2D and PHYSICS 7C",
    "section": "ENGRMAE",
    "title": "Dynamics",
    "units": 4
  },
  {
    "code": 226,
    "corequisites": [],
    "description": "Special topics of current interest in fluid mechanics, heat and mass transfer, multiphase flows, or combustion. Emphasis could be placed on theory, computational methods, or experimental techniques.",
    "design_units": 0,
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Special Topics in Fluid and Thermal Sciences",
    "units": "1-4"
  },
  {
    "code": 227,
    "corequisites": [],
    "description": "Heat transfer and thermal resistance analysis relevant for microdevices and nanomaterials. Overview of recent progress in nanotechnology and materials science. Thermal modeling strategies for novel electronic devices and energy conversion systems.",
    "design_units": 0,
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Thermal Resistance Analysis in Microdevices and Nanomaterials",
    "units": 4
  },
  {
    "code": "218P",
    "corequisites": [],
    "description": "Basic principles, design, and operation of sustainable energy systems including wind, solar photo-voltaic and thermal, hydroelectric, geothermal, oceanic, biomass combustion, advanced coal, and next generation nuclear. Includes power generation, storage, and transmission for stationary power generation.",
    "design_units": 0,
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Sustainable Energy Systems",
    "units": 4
  },
  {
    "code": 228,
    "corequisites": [],
    "description": "Discusses a wide range of phase change processes (i.e., evaporation, boiling, condensation, and freezing) through the use of novel thermal metamaterials with the aim of enhancing phase change performances.",
    "design_units": 0,
    "prerequisites": "Undergraduate-level heat transfer is recommended.",
    "section": "ENGRMAE",
    "title": "Nanoscale Phase Change Transport Physics",
    "units": 4
  },
  {
    "code": "219P",
    "corequisites": [],
    "description": "Basic principles, design, and operation of solar and other renewable energy systems including solar photo-voltaic, solar thermal, wind, and PEM fuel cell. Includes power generation and storage, and renewable fuels for transportation and stationary power generation.",
    "design_units": 0,
    "prerequisites": "Required: Knowledge of applied engineering thermodynamics.",
    "section": "ENGRMAE",
    "title": "Solar and Renewable Energy Systems",
    "units": 4
  },
  {
    "code": "229P",
    "corequisites": [],
    "description": "Introduction to design and synthesis of nanomaterials. Topics include thermal and liquid transport in materials systems, phase change heat transfer physics, and mechanical properties in materials systems.",
    "design_units": 0,
    "prerequisites": "Required: Undergraduate-level knowledge of heat transfer.",
    "section": "ENGRMAE",
    "title": "Nanoscale Materials for Modern Electronics",
    "units": 4
  },
  {
    "code": 218,
    "corequisites": [],
    "description": "Basic principles, design and operation of sustainable energy systems including wind, solar photo-voltaic and thermal, hydroelectric, geothermal, oceanic, biomass combustion, advanced coal and next generation nuclear.  Includes power generation, storage, and transmission for stationary power generation.",
    "design_units": 0,
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Sustainable Energy Systems",
    "units": 4
  },
  {
    "code": "230A",
    "corequisites": [],
    "description": "Equations of motion. Vector notation. Flow kinematics. Potential flow and complex potential. Vorticity and circulation. Bernoulli's theorem. Crocco's theorem. Conformal, Joukowski, and Schwarz-Christoffel transformations.",
    "design_units": 0,
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Inviscid Incompressible Fluid Mechanics I",
    "units": 4
  },
  {
    "code": "217P",
    "corequisites": [],
    "description": "Generalized thermodynamics develops the laws of continuum thermodynamics from a set of plausible and intuitive postulates. The postulates are motivated qualitatively by a statistical description of matter and are justified by a posterior success for the resulting theory.",
    "design_units": 0,
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Generalized Thermodynamics",
    "units": 4
  },
  {
    "code": "230B",
    "corequisites": [],
    "description": "Review of mass, momentum, energy equations. Stress tensor, constitutive relations. Laminar flows. Stokes and Oseen flows. Self-similarity. Boundary layer theory: thin-layer approximation, Falkner-Skan, Blasius solutions, integral methods. Jet, wake, cavity flows. Introduction to turbulence: instability, Reynolds averaging, mixing length.",
    "design_units": 0,
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Viscous Incompressible Fluid Mechanics II",
    "units": 4
  },
  {
    "code": 222,
    "corequisites": [],
    "description": "Black body radiation.  Radiative transport equations for surfaces separated by non-participating media.  Radiant energy transfer through absorbing, emitting, and scattering media. Radiation-conduction interaction.  Radiation-convection interaction.  Introduction to finite-difference solutions.",
    "design_units": 0,
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Radiative Heat Transfer",
    "units": 4
  },
  {
    "code": "230C",
    "corequisites": [],
    "description": "One-dimensional unsteady flow; Riemann invariants, acoustics, shock tube. Two-dimensional flow: shock polars, linear theory, similarity rules, method of characteristics. Three dimensional flow: slender-body theory.  Effects of viscosity and conductivity:  laminar boundary layer, Crocco-Busemann relations.",
    "design_units": 0,
    "prerequisites": "ENGRMAE 230A or ENGRMAE 230B",
    "section": "ENGRMAE",
    "title": "Compressible Fluid Dynamics",
    "units": 4
  },
  {
    "code": 221,
    "corequisites": [],
    "description": "Laminar and turbulent convective heat and mass transfer in external and internal flows. Forced and free convection.  Exact and approximate solutions. Similarity solutions.  Variable properties. Concentration boundary layer theory.  Mass transfer conductance.",
    "design_units": 0,
    "prerequisites": "ENGRMAE 230B",
    "section": "ENGRMAE",
    "title": "Convective Heat and Mass Transfer",
    "units": 4
  },
  {
    "code": "230D",
    "corequisites": [],
    "description": "Well-posed problems and boundary, initial, and interface conditions; strong and weak solutions. Similarity, perturbation theory and limit behavior, bifurcations. Dispersive and nondispersive wave propagation, acoustics, ship waves, internal gravity waves, water waves. Vortices: mutual interactions and stability. Jets, wakes, cavities.",
    "design_units": 0,
    "prerequisites": "ENGRMAE 230A and ENGRMAE 230B",
    "section": "ENGRMAE",
    "title": "Theoretical Foundations of Fluid Mechanics",
    "units": 4
  },
  {
    "code": "130B",
    "corequisites": [],
    "description": "Introduction to the analysis of viscous flows including fully developed laminar and turbulent flow in a pipe, viscous flow over immersed bodies, evaluation of boundary layer characteristics, lift and drag, compressible flow in a duct and normal shock waves.",
    "design_units": 1,
    "prerequisites": "ENGRMAE 130A",
    "section": "ENGRMAE",
    "title": "Introduction to Viscous and Compressible Flows",
    "units": 4
  },
  {
    "code": 220,
    "corequisites": [],
    "description": "Steady state and transient conduction heat transfer in one- and multi-dimensional geometries. Analytical methods, exact and approximate. Numerical techniques are also included.",
    "design_units": 0,
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Conduction Heat Transfer",
    "units": 4
  },
  {
    "code": 231,
    "corequisites": [],
    "description": "Phenomenon of turbulence. Reynolds equations. Dynamics of turbulence. Free turbulent shear flows. Wall-bounded turbulent shear flows. Turbulent transport of scalar quantities. Spectral dynamics. Mathematical models of turbulence.",
    "design_units": 0,
    "prerequisites": "ENGRMAE 230A and ENGRMAE 230B",
    "section": "ENGRMAE",
    "title": "Fundamentals of Turbulence",
    "units": 4
  },
  {
    "code": 217,
    "corequisites": [],
    "description": "Generalized thermodynamics develops the laws of continuum thermodynamics from a set of plausible and intuitive postulates. The postulates are motivated qualitatively by a statistical description of matter and are justified by a posterior success for the resulting theory.",
    "design_units": 0,
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Generalized Thermodynamics",
    "units": 4
  },
  {
    "code": 233,
    "corequisites": [],
    "description": "Practical and theoretical aspects of turbulent free shear flows. Instability, global scaling laws, mixing, and noise generation in incompressible and compressible shear layers, jets, and wakes. Kelvin-Helmholtz instability, near- and far-field growth rates, effect of compressibility, aeroacoustics of jets.",
    "design_units": 0,
    "prerequisites": "ENGRMAE 200B and ENGRMAE 230A and ENGRMAE 230B",
    "section": "ENGRMAE",
    "title": "Turbulent Free Shear Flows",
    "units": 4
  },
  {
    "code": 93,
    "corequisites": [],
    "description": "Early-stage design/hands-on experience for students, and allows them to participate alongside seniors in the design project.",
    "design_units": 1,
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Topics in Design Project",
    "units": "1-4"
  },
  {
    "code": 106,
    "corequisites": [],
    "description": "Experiments in linear systems, including op-amp circuits, vibrations, and control systems. Emphasis on demonstrating that mathematical models can be useful tools for the analysis and design of electro-mechanical systems.  Materials fee.",
    "design_units": 2,
    "prerequisites": "ENGRMAE 60 or EECS 70A",
    "section": "ENGRMAE",
    "title": "Mechanical Systems Laboratory",
    "units": 4
  },
  {
    "code": 236,
    "corequisites": [],
    "description": "Molecular description of fluid flow. Boltzmann equation. Chapman-Enskog expansion for flows with translational nonequilibrium. Shock structure. Inviscid flows with chemical and vibrational nonequilibrium. Not offered every year.",
    "design_units": 0,
    "prerequisites": "ENGRMAE 230C",
    "section": "ENGRMAE",
    "title": "Nonequilibrium Gas Dynamics",
    "units": 4
  },
  {
    "code": 107,
    "corequisites": "ENGRMAE 120",
    "description": "Fluid and thermal engineering laboratory. Experimental analysis of fluid flow, heat transfer, and thermodynamic systems. Probability, statistics, and uncertainly analysis. Report writing is emphasized and a design project is required. Materials fee.",
    "design_units": 1,
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Fluid Thermal Science Laboratory",
    "units": 4
  },
  {
    "code": 237,
    "corequisites": [],
    "description": "Mathematical, physical, and computational fundamentals of computational fluid dynamics, numerical methods for solving the Euler and Navier-Stokes equations. Topics include: finite-difference and finite-volume discretization, time marching methods, von Neumann analysis, upwinding, flux splitting, TVD, and other high-resolution shock-capturing schemes.",
    "design_units": 0,
    "prerequisites": "ENGRMAE 230C",
    "section": "ENGRMAE",
    "title": "Computational Fluid Dynamics",
    "units": 4
  },
  {
    "code": 108,
    "corequisites": [],
    "description": "Analytical and experimental investigation in aerodynamics, fluid dynamics, and heat transfer. Emphasis on study of flow over objects and lift and drag on airfoils. Introduction to basic diagnostic techniques. Report writing is emphasized. Design project is required.",
    "design_units": 2,
    "prerequisites": "ENGRMAE 130B",
    "section": "ENGRMAE",
    "title": "Aerospace Laboratory",
    "units": 4
  },
  {
    "code": 238,
    "corequisites": [],
    "description": "Concepts and techniques for measurement of fluid motion. Quantitative and qualitative flow visualization. Flow facilities, shadowgraph, schlieren, interferometer, thermal anemometer. Laser diagnostics, fluorescence, Rayleigh, Raman, Mie scattering. Laser-Doppler, particle-image, and image- correlation velocimetry. Three- and four-dimensional digital imaging.",
    "design_units": 0,
    "prerequisites": "ENGRMAE 230A and ENGRMAE 230B",
    "section": "ENGRMAE",
    "title": "Experimental Fluid Dynamics",
    "units": 4
  },
  {
    "code": 110,
    "corequisites": [],
    "description": "Fundamentals of gaseous, liquid, and coal-fired combustion and fuel cell systems. Fuels, fuel-air mixing, aerodynamics, and combustion and fuel cell thermodynamics. Operating and design aspects of practical systems including engines, power generators, boilers, furnaces, and incinerators.",
    "design_units": 2,
    "prerequisites": "ENGRMAE 115",
    "section": "ENGRMAE",
    "title": "Combustion and Fuel Cell Systems",
    "units": 4
  },
  {
    "code": 239,
    "corequisites": [],
    "description": "Unsteady potential flow modeling (Kelvin's circulation theorem, unsteady Bernoulli's equation). Theodorsen's frequency response, Wagner's step response, and the Kussner sharp-edged gust. State Space approximations for Unsteady Loads. Vortex Lattice. Flutter.",
    "design_units": 0,
    "prerequisites": "ENGRMAE 230A is recommended.",
    "section": "ENGRMAE",
    "title": "Dynamics of Unsteady Flows",
    "units": 4
  },
  {
    "code": 112,
    "corequisites": [],
    "description": "Application of thermodynamics and fluid mechanics to basic flow processes and cycle performance in propulsion systems: gas turbines, ramjets, scramjets, and rockets.",
    "design_units": 1,
    "prerequisites": "ENGRMAE 135",
    "section": "ENGRMAE",
    "title": "Propulsion",
    "units": 4
  },
  {
    "code": 241,
    "corequisites": [],
    "description": "Kinematics and dynamics of three-dimensional motions. Lagrange's equations, Newton-Euler equations. Applications include robot systems and spinning satellites.",
    "design_units": 0,
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Dynamics",
    "units": 4
  },
  {
    "code": 113,
    "corequisites": [],
    "description": "Space propulsion requirements and maneuvers, stressing those best suited to electric propulsion. An introduction to plasma physics. Electrothermal, electromagnetic, and electrostatis accelerators, with emphasis in technologies (ion engines, Hall thrusters, and colloidal thrusters) belonging to the latter family.",
    "design_units": 1,
    "prerequisites": "ENGRMAE 112",
    "section": "ENGRMAE",
    "title": "Electric Propulsion",
    "units": 4
  },
  {
    "code": 242,
    "corequisites": [],
    "description": "Spatial rigid-body transformations.  Forward and inverse kinematics. Jacobian of serial and parallel chains.  Screw coordinates and transformations. Rate and static analyses using screw theory. Singularity analysis. Trajectory generation. Not offered every year.",
    "design_units": 0,
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Robotics",
    "units": 4
  },
  {
    "code": 114,
    "corequisites": [],
    "description": "Introduction to electrochemistry and electrocatalysis; nature of fuel-cell electrodes and electrolytes; charge transfer reactions at interfaces; charge transport and mass transport processes; fuel processing reactions; determination of fuel cell efficiency, fuel flexibility, emissions, and other characteristics.",
    "design_units": 0,
    "prerequisites": "ENGRMAE 115",
    "section": "ENGRMAE",
    "title": "Fuel Cell Fundamentals and Technology",
    "units": 4
  },
  {
    "code": 244,
    "corequisites": [],
    "description": "Spatial rigid body kinematics is presented with applications to robotics. Orthogonal Matrices, Rodrigues' formula, Quaternions, Plucker coordinates, screw theory, and dual numbers are studied using modern projective geometry and multi-linear algebra. Applications include trajectory planning, inverse kinematics, and workspace analysis.",
    "design_units": 0,
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Theoretical Kinematics",
    "units": 4
  },
  {
    "code": 115,
    "corequisites": [],
    "description": "Application of thermodynamic principles to compressible and incompressible processes representative of practical engineering problems; power cycles, refrigeration cycles, multicomponent mixtures, air conditioning systems, combustion, and compressible flow. Design of a thermodynamic process.",
    "design_units": 2,
    "prerequisites": "ENGRMAE 91 or CBE 40B or ENGRMSE 65A",
    "section": "ENGRMAE",
    "title": "Applied Engineering Thermodynamics",
    "units": 4
  },
  {
    "code": 245,
    "corequisites": [],
    "description": "Fundamental kinematic theory required for planar, spherical, and spatial mechanism design. The focus is on algebraic methods for the exact solution of constraint equations. Not offered every year.",
    "design_units": 0,
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Spatial Mechanism Design",
    "units": 4
  },
  {
    "code": 117,
    "corequisites": [],
    "description": "Basic principles, design, and operation of solar and other renewable energy systems including solar photo-voltaic, solar thermal, wind, and PEM fuel cell. Includes power generation and storage, and renewable fuels for transportation and stationary power generation.",
    "design_units": 1,
    "prerequisites": "(ENGRMAE 91 or CBE 40B)",
    "section": "ENGRMAE",
    "title": "Solar and Renewable Energy Systems",
    "units": 4
  },
  {
    "code": 247,
    "corequisites": [],
    "description": "Covers the fundamentals of the many disciplines needed for design of Micro-Electro-Mechanical Systems (MEMS): microfabrication technology, structural mechanics on micro-scale, electrostatics, circuit interface, control, computer-aided design, and system integration.",
    "design_units": 0,
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Micro-System Design",
    "units": 4
  },
  {
    "code": 118,
    "corequisites": [],
    "description": "Basic principles, design, and operation of sustainable energy systems including wind, solar photo-voltaic and thermal, hydroelectric, geothermal, oceanic, biomass combustion, advanced coal, and next generation nuclear. Includes power generation, storage, and transmission for stationary power generation.",
    "design_units": 1,
    "prerequisites": "ENGRMAE 115",
    "section": "ENGRMAE",
    "title": "Sustainable Energy Systems",
    "units": 4
  },
  {
    "code": "247P",
    "corequisites": [],
    "description": "Covers the fundamentals of the many disciplines needed for design of Micro-Electro-Mechanical Systems (MEMS): microfabrication technology, structural mechanics on micro-scale, electrostatics, circuit interface, control, computer-aided design, and system integration.",
    "design_units": 0,
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Micro-System Design",
    "units": 4
  },
  {
    "code": 119,
    "corequisites": [],
    "description": "Focuses on carbon neutrality and climate stability, addressing.",
    "design_units": 0,
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Climate Solutions",
    "units": 4
  },
  {
    "code": 236,
    "corequisites": [],
    "description": "Molecular description of fluid flow. Boltzmann equation. Chapman-Enskog expansion for flows with translational nonequilibrium. Shock structure. Inviscid flows with chemical and vibrational nonequilibrium. Not offered every year.",
    "design_units": 0,
    "prerequisites": "ENGRMAE 230C",
    "section": "ENGRMAE",
    "title": "Nonequilibrium Gas Dynamics",
    "units": 4
  },
  {
    "code": 249,
    "corequisites": [],
    "description": "Introduction to the technology of Micro-Electro-Mechanical Systems (MEMS). Fundamental principles and applications of important microsensors, actuation principles on microscale.  Introduction to the elements of signal processing; processing of materials for micro sensor/actuator fabrication; smart sensors and microsensor/microactuator array devices.",
    "design_units": 0,
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Micro-Sensors and Actuators",
    "units": 4
  },
  {
    "code": 212,
    "corequisites": [],
    "description": "Introduction to engineering electrochemistry fundamentals and applications. Examine thermodynamics and transport principles in typical electrochemical systems. Electrochemical sensors, batteries, fuel cells, and supercapacitors. Manufacturing aspects will also be covered.",
    "design_units": 0,
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Engineering Electrochemistry: Fundamentals and Applications",
    "units": 4
  },
  {
    "code": 120,
    "corequisites": [],
    "description": "Fundamentals of heat and mass transfer. Conduction, heat and mass transfer by convection in laminar and turbulent flows, radiation heat transfer, and combined modes of heat and mass transfer. Practical engineering applications.",
    "design_units": 0,
    "prerequisites": "ENGRMAE 130B",
    "section": "ENGRMAE",
    "title": "Heat and Mass Transfer",
    "units": 4
  },
  {
    "code": 250,
    "corequisites": [],
    "description": "Sensors, actuators, and neural circuits for biological movement control from an engineering perspective.  Current approaches to robotic and mechatronic devices that support and enhance human movement in health and following neurologic injuries like stroke and spinal cord injury.",
    "design_units": 0,
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Biorobotics",
    "units": 4
  },
  {
    "code": "130A",
    "corequisites": "ENGRMAE 91",
    "description": "Fundamental concepts; fluid statics; fluid dynamics; Bernoulli's equation; control-volume analysis; basic flow equations of conservation of mass, momentum, and energy; differential analysis; potential flow; viscous incompressible flow.",
    "design_units": 0,
    "prerequisites": "PHYSICS 7C and MATH 2D and MATH 2E and MATH 3D and (ENGRMAE 30 or ENGRCEE 30 or ENGR 30) and (ENGRMAE 80 or ENGRCEE 80 or ENGR 80). PHYSICS 7C with a grade of C- or better. MATH 2D with a grade of C- or better. MATH 2E with a grade of C- or better. MATH 3D with a grade of C- or better. ENGRMAE 30 with a grade of C- or better. ENGRCEE 30 with a grade of C- or better. ENGR 30 with a grade of C- or better. ENGRMAE 80 with a grade of C- or better. ENGRCEE 80 with a grade of C- or better. ENGR 80 with a grade of C- or better",
    "section": "ENGRMAE",
    "title": "Introduction to Fluid Mechanics",
    "units": 4
  },
  {
    "code": 252,
    "corequisites": [],
    "description": "Introduces Engineering and Science students to the science of miniaturization. Different options to make very small machines (micro and nano size) are reviewed, materials choices are discussed, scaling laws are analyzed, and many practical applications are listed.",
    "design_units": 0,
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Fundamentals of Microfabrication",
    "units": 4
  },
  {
    "code": "130B",
    "corequisites": [],
    "description": "Introduction to the analysis of viscous flows including fully developed laminar and turbulent flow in a pipe, viscous flow over immersed bodies, evaluation of boundary layer characteristics, lift and drag, compressible flow in a duct and normal shock waves.",
    "design_units": 1,
    "prerequisites": "ENGRMAE 130A",
    "section": "ENGRMAE",
    "title": "Introduction to Viscous and Compressible Flows",
    "units": 4
  },
  {
    "code": "252P",
    "corequisites": [],
    "description": "Introduces engineering and science students to the science of miniaturization. Different options to make very small machines (micro and nano size) are reviewed, materials choices are discussed, scaling laws are analyzed, and many practical applications are listed.",
    "design_units": 0,
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Fundamentals of Microfabrication",
    "units": 4
  },
  {
    "code": 132,
    "corequisites": [],
    "description": "Introduction to computational fluid dynamics in simple engineering devices. The numerical simulations will be performed via the widely-used software ANSYS-Fluent. While Fluent is the choice of software, all major CFD packages are based on a similar numerical method.",
    "design_units": 0,
    "prerequisites": "ENGRMAE 130B. ENGRMAE 130B with a grade of C- or better",
    "section": "ENGRMAE",
    "title": "Computational Fluid Dynamics",
    "units": 4
  },
  {
    "code": 253,
    "corequisites": [],
    "description": "Introduction to BIOMEMS. Advanced biotechnology/biomedicine equipment based on MEMS and NEMS. Fundamentals of MEMS/NEMS sensing techniques and the biological and physics principles involved and the preferred MEMS and NEMS manufacturing techniques.",
    "design_units": 0,
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Advanced BIOMEMS Manufacturing Techniques",
    "units": 4
  },
  {
    "code": 135,
    "corequisites": [],
    "description": "Compressibility effects in fluid mechanics. One-dimensional flow with area variation, friction, heat transfer, and shocks. Design of gas supply systems. Two-dimensional flow with oblique shocks and isentropic waves. Supersonic airfoil theory and design, wind tunnel design. Basic diagnostics.",
    "design_units": 1,
    "prerequisites": "ENGRMAE 130A",
    "section": "ENGRMAE",
    "title": "Compressible Flow",
    "units": 4
  },
  {
    "code": 254,
    "corequisites": [],
    "description": "Finite deformation kinematics; stress and strain measures; invariance in solid mechanics; objective rates; constitutive theory of elastic and inelastic solids; rate formulations; computational approaches; theories of plates and shells; applications to aerospace vehicles.",
    "design_units": 0,
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Mechanics of Solids and Structures",
    "units": 4
  },
  {
    "code": 136,
    "corequisites": [],
    "description": "Analysis of flow over aircraft wings and airfoils, prediction of lift, moment, and drag. Topics: fluid dynamics equations; flow similitude; viscous effects; vorticity, circulation, Kelvin's theorem, potential flow; superposition principle, Kutta-Joukowski theorem; thin airfoil theory; finite wing theory; compressibility.",
    "design_units": 1,
    "prerequisites": "ENGRMAE 130B",
    "section": "ENGRMAE",
    "title": "Aerodynamics",
    "units": 4
  },
  {
    "code": "254P",
    "corequisites": [],
    "description": "Finite deformation kinematics; stress and strain measures; invariance in solid mechanics; objective rates; constitutive theory of elastic and inelastic solids; rate formulations; computational approaches; theories of plates and shells; applications to aerospace vehicles.",
    "design_units": 0,
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Mechanics of Solids and Structures",
    "units": 4
  },
  {
    "code": 132,
    "corequisites": [],
    "description": "Introduction to computational fluid dynamics in simple engineering devices. The numerical simulations will be performed via the widely-used software ANSYS-Fluent. While Fluent is the choice of software, all major CFD packages are based on a similar numerical method.",
    "design_units": 0,
    "prerequisites": "ENGRMAE 130B. ENGRMAE 130B with a grade of C- or better",
    "section": "ENGRMAE",
    "title": "Computational Fluid Dynamics",
    "units": 4
  },
  {
    "code": 145,
    "corequisites": [],
    "description": "Presents the basic mathematical theory of machines. Focuses on the principles of cam design, gearing and gear train analysis, and the kinematic and dynamic analysis of linkages, together with an introduction to robotics.",
    "design_units": 2,
    "prerequisites": "ENGRMAE 52 and (ENGRMAE 80 or ENGRCEE 80 or ENGR 80) and (MATH 3A or I&C SCI 6N)",
    "section": "ENGRMAE",
    "title": "Theory of Machines and Mechanisms",
    "units": 4
  },
  {
    "code": 255,
    "corequisites": [],
    "description": "Motivation for composite materials. Different classifications according to the nature of the matrix (PMC, MMC, CMC) and the reinforcement topology (fibers, whiskers, particulates). Mechanical properties. Failure mechanisms. Designing with composite materials. Advantages and limitations of homogenization techniques for numerical modeling.",
    "design_units": 0,
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Composite Materials and Structures",
    "units": 4
  },
  {
    "code": 146,
    "corequisites": [],
    "description": "Motion in gravitational force fields, orbit transfers, rocketry, interplanetary trajectories, attitude dynamics and stabilization, navigation, reentry, the space environment.",
    "design_units": 1,
    "prerequisites": "ENGRMAE 80 or ENGRCEE 80 or ENGR 80",
    "section": "ENGRMAE",
    "title": "Astronautics",
    "units": 4
  },
  {
    "code": 256,
    "corequisites": [],
    "description": "Nanoscale materials and the experimental and computational techniques used to measure their properties.  Mechanical behavior is the main focus, but other material properties such as diffusion and electron transport are discussed.",
    "design_units": 0,
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Nanomechanics",
    "units": 4
  },
  {
    "code": 147,
    "corequisites": [],
    "description": "Analysis of structural vibrations of mechanical systems. Modeling for lumped and distributed parameter systems. Topics include single and multi-degree of freedom systems, free and forced vibrations, Fourier series, convolution integral, mass/stiffness matrices, and normal modes with design project.",
    "design_units": 1,
    "prerequisites": "(ENGR 80 or ENGRCEE 80 or ENGRMAE 80) and MATH 2E and MATH 3D",
    "section": "ENGRMAE",
    "title": "Vibrations",
    "units": 4
  },
  {
    "code": "257P",
    "corequisites": [],
    "description": "Introduction to nanoscale materials and experimental and computational techniques. Topics materials synthesis techniques, thin film deposition, nanoparticle and nanowire growth, characterization with electrons and X-rays, forces and surface interactions at the nanoscale, structure-property scaling laws, and atomistic/multiscale computer modeling.",
    "design_units": 0,
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Fabrication and Characterization of Nanomaterials",
    "units": 4
  },
  {
    "code": "200A",
    "corequisites": [],
    "description": "Linear algebra, including vector spaces, matrices, linear systems of equations, least squares, and the eigenvalue problem. Ordinary differential equations, including analytical and numerical solution methods, stability, and phase portraits.",
    "design_units": 0,
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Engineering Analysis I",
    "units": 4
  },
  {
    "code": 150,
    "corequisites": [],
    "description": "Stresses and strains. Torsion. Bending. Beam deflection.  Shear force and moment distributions in beams. Yielding and buckling of columns. Combined loading. Transformation of stresses and strain. Yielding criteria. Finite elements analysis of frames. Dynamic of two-bar truss.",
    "design_units": 2,
    "prerequisites": "(ENGRCEE 30 or ENGR 30 or ENGRMAE 30) and MATH 3A",
    "section": "ENGRMAE",
    "title": "Mechanics of Structures",
    "units": 4
  },
  {
    "code": 258,
    "corequisites": [],
    "description": "Presents a continuum, macroscopic view of deformation and failure of solids. Covers elasticity, plasticity, visco-elasticity, visco-plasticity, fracture and fatigue. Topics include discussions of physical behavior, mathematical formalism and measurement techniques.",
    "design_units": 0,
    "prerequisites": "ENGRMAE 254",
    "section": "ENGRMAE",
    "title": "Mechanical Behavior of Solids - Continuum Theories",
    "units": 4
  },
  {
    "code": "150L",
    "corequisites": "ENGRMAE 150",
    "description": "Experimental techniques for the measurement of mechanical properties of materials and structures. Methods for load, displacement, and strain measurements. Tension, bending, compression tests. Determination of strength, stiffness, toughness for metals, polymers, ceramics, and composites. Deformation of structures. Materials fee.",
    "design_units": 0,
    "prerequisites": "ENGRMAE 30 or ENGR 30 or ENGRCEE 30",
    "section": "ENGRMAE",
    "title": "Mechanics of Structures Laboratory",
    "units": 1
  },
  {
    "code": 259,
    "corequisites": [],
    "description": "Presents atomistic mechanisms that control mechanical behavior of materials. Covers plasticity, dislocation theory, strengthening mechanisms, high-temperature diffusion and gain boundary sliding, shear localization, void formation, ductile rupture, brittle fracture and fatigue.",
    "design_units": 0,
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Mechanical Behavior of Solids - Atomistic Theories",
    "units": 4
  },
  {
    "code": 151,
    "corequisites": "ENGRMAE 170",
    "description": "A comprehensive group design project experience that involves identifying customer needs, idea generation, reverse engineering, preliminary design, standards, prototype development, testing, analysis, and redesign of a product involving fluid, thermal, and mechanical components.  Introduces design for manufacturing and the environment. Materials fee.",
    "design_units": 3,
    "prerequisites": "ENGRMAE 120 and ENGRMAE 145",
    "section": "ENGRMAE",
    "title": "Mechanical Engineering Design",
    "units": 4
  },
  {
    "code": "259P",
    "corequisites": [],
    "description": "Presents atomistic mechanisms that control mechanical behavior of materials. Covers plasticity, dislocation theory, strengthening mechanisms, high-temperature diffusion and gain boundary sliding, shear localization, void formation, ductile rupture, brittle fracture, and fatigue.",
    "design_units": 0,
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Mechanical Behavior of Solids - Atomistic Theories",
    "units": 4
  },
  {
    "code": 91,
    "corequisites": [],
    "description": "Thermodynamic principles; open and closed systems representative of engineering problems. First and second law of thermodynamics with applications to engineering systems and design.",
    "design_units": "0.5",
    "prerequisites": "PHYSICS 7C and MATH 2D",
    "section": "ENGRMAE",
    "title": "Introduction to Thermodynamics",
    "units": 4
  },
  {
    "code": 152,
    "corequisites": [],
    "description": "Elements and principles of computer-aided engineering with modern hardware and software are presented with a design focus. Case studies are used to assist in finite-element method techniques. Not offered every year.",
    "design_units": 2,
    "prerequisites": "(ENGRMAE 150 or ENGR 150) and ENGRMAE 120",
    "section": "ENGRMAE",
    "title": "Introduction to Computer-Aided Engineering",
    "units": 4
  },
  {
    "code": 260,
    "corequisites": [],
    "description": "Current issues related to the atmosphere, climate, and air quality in the context of energy conversion and sustainability. Topics include transportation systems; building design; impacts on humans and ecosystems; modeling and meteorology; economics; and application to public policies.",
    "design_units": 0,
    "prerequisites": "ENGRMAE 261 or CHEM 245 or EARTHSS 240",
    "section": "ENGRMAE",
    "title": "Current Issues Related to Air Quality, Climate, and Energy",
    "units": 4
  },
  {
    "code": 153,
    "corequisites": [],
    "description": "Introduction to BIOMEMS. Advanced biotechnology/biomedicine equipment based on MEMS and NEMS. Fundamentals of MEMS/NEMS sensing techniques and the biological and physics principles involved and the preferred MEMS and NEMS manufacturing techniques.",
    "design_units": 0,
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Advanced BIOMEMS Manufacturing Techniques",
    "units": 4
  },
  {
    "code": "270A",
    "corequisites": [],
    "description": "Input-output and state-space representations of continuous-time linear systems. State transition matrices,  Controllability and observability. Irreducible realizations.  State feedback and observer design.",
    "design_units": 0,
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Linear Systems I",
    "units": 4
  },
  {
    "code": 155,
    "corequisites": [],
    "description": "Motivation for composite materials. Different classifications according to the nature of the matrix (PMC, MMC, CMC) and the reinforcement topology (fibers, whiskers, particulates).  Mechanical properties. Failure mechanisms. Designing with composite materials. Advantages and limitations of homogenization techniques for numerical modeling.",
    "design_units": 0,
    "prerequisites": "ENGR 54 and (ENGRMAE 150 or ENGRCEE 150 or ENGR 150)",
    "section": "ENGRMAE",
    "title": "Composite Materials and Structures",
    "units": 4
  },
  {
    "code": "270B",
    "corequisites": [],
    "description": "Advanced topics in linear systems: bases, linear operator representations, and Jordan forms. Review of dynamical systems, and stability. Time-varying systems, discrete-time representations, and multi-input/multi-output systems. Introduction to continuous and discrete time linear regulator (LQR) problems. Not offered every year.",
    "design_units": 0,
    "prerequisites": "ENGRMAE 270A",
    "section": "ENGRMAE",
    "title": "Linear Systems II",
    "units": 4
  },
  {
    "code": 156,
    "corequisites": [],
    "description": "Principles governing structure and mechanical behavior of materials, relationship relating microstructure and mechanical response with application to elasticity, plasticity, yielding, necking, creep, and fracture of materials. Introduction to experimental techniques to characterize the properties of materials. Design parameters.",
    "design_units": 2,
    "prerequisites": "ENGR 54",
    "section": "ENGRMAE",
    "title": "Mechanical Behavior and Design Principles",
    "units": 4
  },
  {
    "code": 272,
    "corequisites": [],
    "description": "Methods for control design of systems with uncertainty. Feedback stability and small gain theorem. Multivariable stability margins and multiplier theory. H-infinity-optimal control, linear matrix inequalities. Not offered every year.",
    "design_units": 0,
    "prerequisites": "ENGRMAE 270A",
    "section": "ENGRMAE",
    "title": "Robust Control Theory",
    "units": 4
  },
  {
    "code": 157,
    "corequisites": [],
    "description": "Fundamentals of torsion and bending. Analysis and design of thin-wall and composite beams. Stress analysis of aircraft components. Stiffness, strength, and buckling. Introduction to the Finite Element method and its application to plates and shells.",
    "design_units": 2,
    "prerequisites": "ENGR 150 or ENGRCEE 150 or ENGRMAE 150",
    "section": "ENGRMAE",
    "title": "Lightweight Structures",
    "units": 4
  },
  {
    "code": 274,
    "corequisites": [],
    "description": "Principles and methods of optimal control. Topics include objectives and issues in controlling nonlinear systems; linear variational and adjoint equations; optimality conditions via variational calculus, maximum principle, and dynamic programming; solution methods; applications to control robots and aerospace vehicles.",
    "design_units": 0,
    "prerequisites": "ENGRMAE 200A and ENGRMAE 270A",
    "section": "ENGRMAE",
    "title": "Optimal Control",
    "units": 4
  },
  {
    "code": 158,
    "corequisites": [],
    "description": "Flight theory applied to subsonic propeller and jet aircraft. Nature of aerodynamic forces, drag and lift of wing and fuselage, high-lift devices, level-flight performance, climb and glide performance, range, endurance, take-off and landing distances, static and dynamic stability and control.",
    "design_units": 2,
    "prerequisites": "ENGRMAE 130A",
    "section": "ENGRMAE",
    "title": "Aircraft Performance",
    "units": 4
  },
  {
    "code": 275,
    "corequisites": [],
    "description": "Advanced tools for feedback control system analysis and synthesis. Norms, operators, Lp spaces, contraction mapping theorem, Lyapunov techniques along with their extensions. Circle criterion positivity and passivity. Applications to nonlinear control methods, such as sliding mode or adaptive techniques.",
    "design_units": 0,
    "prerequisites": "ENGRMAE 270B",
    "section": "ENGRMAE",
    "title": "Nonlinear Feedback Systems",
    "units": 4
  },
  {
    "code": 159,
    "corequisites": [],
    "description": "Preliminary design of subsonic general aviation and transport aircraft with emphasis on layout, aerodynamic design, propulsion, and performance. Estimation of total weight and weight distribution, design of wings, fuselage, and tail, selection and location of engines, prediction of overall performance.",
    "design_units": 4,
    "prerequisites": "ENGRMAE 112 and ENGRMAE 136 and ENGRMAE 158",
    "section": "ENGRMAE",
    "title": "Aircraft Design",
    "units": 4
  },
  {
    "code": 276,
    "corequisites": [],
    "description": "Using the mathematics of differential geometry, a number of the concepts and results of linear systems theory have been extended to nonlinear systems. Describes these extensions and illustrate their use in nonlinear system analysis and design. Not offered every year.",
    "design_units": 0,
    "prerequisites": "ENGRMAE 200A and ENGRMAE 270A",
    "section": "ENGRMAE",
    "title": "Geometric Nonlinear Control",
    "units": 4
  },
  {
    "code": 164,
    "corequisites": [],
    "description": "Sources, dispersion, and effects of air pollutants. Topics include emission factors, emission inventory, air pollution, meteorology, air chemistry, air quality modeling, impact assessment, source and ambient monitoring, regional control strategies.",
    "design_units": 2,
    "prerequisites": "(ENGRMAE 91 or CBE 40B) and ENGRMAE 130A",
    "section": "ENGRMAE",
    "title": "Air Pollution and Control",
    "units": 4
  },
  {
    "code": 277,
    "corequisites": [],
    "description": "Supervised learning for classification and regression: perceptrons, support vector machines, feed-forward neural networks, Gaussian processes. Generalization and model selection: cross-validation, regularization, and Bayesian methods. Unsupervised learning: clustering and dimensionality reduction. Learning control systems. Introduction to reinforcement learning.",
    "design_units": 0,
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Learning Control Systems",
    "units": 4
  },
  {
    "code": 170,
    "corequisites": [],
    "description": "Feedback control systems. Modeling, stability, and systems specifications. Root locus, Nyquist, and Bode methods of analysis and design.",
    "design_units": 2,
    "prerequisites": "(ENGRMAE 80 or ENGRCEE 80 or ENGR 80) and ENGRMAE 106",
    "section": "ENGRMAE",
    "title": "Introduction to Control Systems",
    "units": 4
  },
  {
    "code": 278,
    "corequisites": [],
    "description": "Bayesian and frequentist approaches to parameter and state estimation. Properties of estimators. Linear Gaussian systems and the Kalman Filter. Nonlinear state estimation, extended and unscented Kalman Filters. Introduction to Monte Carlo methods and particle filtering. Application to tracking and navigation.",
    "design_units": 0,
    "prerequisites": "ENGRMAE 200A and ENGRMAE 270A",
    "section": "ENGRMAE",
    "title": "Parameter and State Estimation",
    "units": 4
  },
  {
    "code": 171,
    "corequisites": [],
    "description": "Methods for analysis and design of discrete-time control systems. Z-transforms, difference equations, discrete Fourier transforms. Sampling theorem and applications.  Z-plane stability, frequency response. Digital controller design. Introduction to digital filters.",
    "design_units": 2,
    "prerequisites": "ENGRMAE 170",
    "section": "ENGRMAE",
    "title": "Digital Control Systems",
    "units": 4
  },
  {
    "code": 279,
    "corequisites": [],
    "description": "Selected topics of current interest in mechanical systems. Topics include robotics, kinematics, control, dynamics, and geometric modeling.",
    "design_units": 0,
    "prerequisites": "ENGRMAE 270A and ENGRMAE 241",
    "section": "ENGRMAE",
    "title": "Special Topics in Mechanical Systems",
    "units": 4
  },
  {
    "code": 172,
    "corequisites": "ENGRMAE 60",
    "description": "Students design a small robotic device and program it to exhibit sentient behaviors. The basic aspects of mechatronic design are covered, including motor and sensor selection, control strategies, and microcomputer programming for the implementation of control paradigms.  Materials fee.",
    "design_units": 3,
    "prerequisites": "ENGRMAE 170",
    "section": "ENGRMAE",
    "title": "Design of Computer-Controlled Robots",
    "units": 4
  },
  {
    "code": 280,
    "corequisites": [],
    "description": "The basic aspects of mechatronic design are covered, including motor and sensor selection, control strategies, finite state machines, inertial measurement units, and implementation of advanced feedback control laws. Students work in groups to create their own mechatronic device. Materials fee.",
    "design_units": 0,
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Design of Computer-Controlled Robots",
    "units": 4
  },
  {
    "code": 135,
    "corequisites": [],
    "description": "Compressibility effects in fluid mechanics. One-dimensional flow with area variation, friction, heat transfer, and shocks. Design of gas supply systems. Two-dimensional flow with oblique shocks and isentropic waves. Supersonic airfoil theory and design, wind tunnel design. Basic diagnostics.",
    "design_units": 1,
    "prerequisites": "ENGRMAE 130A",
    "section": "ENGRMAE",
    "title": "Compressible Flow",
    "units": 4
  },
  {
    "code": 175,
    "corequisites": [],
    "description": "Equations of motion, linearization, stability derivatives, and longitudinal and lateral modes of motion. Handling qualities, sensors and actuators, and effects of various feedbacks on stability and performance. Stability augmentation. Autopilot design.",
    "design_units": 3,
    "prerequisites": "ENGRMAE 106",
    "section": "ENGRMAE",
    "title": "Dynamics and Control of Aerospace Vehicles",
    "units": 4
  },
  {
    "code": 284,
    "corequisites": [],
    "description": "Fundamentals and principles of statistical experimental design and analysis. Emphasis addresses understanding and use of designed experiments, response surfaces, linear regression modeling, process optimization, and development of links between empirical and theoretical models.",
    "design_units": 0,
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Fundamentals of Experimental Design",
    "units": 4
  },
  {
    "code": 182,
    "corequisites": [],
    "description": "Fundamental principles necessary to understand statistical learning methods. Introduction to the R programming language. Mathematical foundation for various machine learning algorithms. Computer implementation.",
    "design_units": 0,
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Introduction to Machine Learning",
    "units": 4
  },
  {
    "code": 294,
    "corequisites": [],
    "description": "Tutorial in which masters-level students taking the comprehensive examination option undertake a masters-level research project.",
    "design_units": 0,
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Master of Science Thesis Project",
    "units": 4
  },
  {
    "code": 183,
    "corequisites": [],
    "description": "Focuses on design of planar, spherical, and spatial mechanisms using computer algebra and graphics. Topics include exact and approximate analytical design techniques. Students are required to use existing software (or develop new algorithms) to design various mechanisms for new applications.",
    "design_units": 4,
    "prerequisites": "MATH 3A or I&C SCI 6N",
    "section": "ENGRMAE",
    "title": "Computer-Aided Mechanism Design",
    "units": 4
  },
  {
    "code": 295,
    "corequisites": [],
    "description": "Special topics by individual faculty in major fields of interest.",
    "design_units": 0,
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Special Topics in Mechanical and Aerospace Engineering",
    "units": "1-4"
  },
  {
    "code": 184,
    "corequisites": [],
    "description": "Review of statistics as applied to experimental research. Fundamentals and principles of statistical experimental design and analysis with emphasis on understanding and use of designed experiments, response surfaces, linear regression modeling, and process optimization.",
    "design_units": 1,
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Fundamentals of Experimental Design",
    "units": 4
  },
  {
    "code": "295P",
    "corequisites": [],
    "description": "Studies in selected areas of Mechanical and Aerospace Engineering. Topics addressed vary each quarter.",
    "design_units": 0,
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Special Topics in Mechanical and Aerospace Engineering",
    "units": 4
  },
  {
    "code": 185,
    "corequisites": [],
    "description": "Solution of mechanical-engineering equations by means of numerical methods. Errors in numerical analysis. Nonlinear equation and sets of equations. Numerical differentiation and integration. Ordinary differential equations. Boundary-value problems. Partial differential equations.",
    "design_units": 2,
    "prerequisites": "(ENGRMAE 10 or EECS 10 or EECS 12 or BME 60B) and MATH 3D and MATH 2E",
    "section": "ENGRMAE",
    "title": "Numerical Analysis in Mechanical Engineering",
    "units": 4
  },
  {
    "code": 296,
    "corequisites": [],
    "description": "Individual research or investigation conducted in the pursuit of preparing and completing the thesis required for the M.S. in Engineering.",
    "design_units": 0,
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Master of Science Thesis Research",
    "units": "1-16"
  },
  {
    "code": 188,
    "corequisites": [],
    "description": "Principles of engineering design in the context of an industrial application. Local manufacturing firms define an engineering design project to be completed in 10 weeks. Projects include initial brainstorming to final design, with a formal presentation.",
    "design_units": 4,
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Engineering Design in Industry",
    "units": 4
  },
  {
    "code": 297,
    "corequisites": [],
    "description": "Individual research or investigation conducted in the pursuit of preparing and completing the dissertation required for the Ph.D. in Engineering.",
    "design_units": 0,
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Doctor of Philosophy Dissertation Research",
    "units": "1-16"
  },
  {
    "code": 189,
    "corequisites": [],
    "description": "Group or individual senior project of theoretical or applied nature involving design. Materials fee.",
    "design_units": "1-4",
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Senior Project - Special Topics",
    "units": "1-4"
  },
  {
    "code": 298,
    "corequisites": [],
    "description": "Presentation of advanced topics and reports of current research efforts in mechanical engineering. Required of all graduate students in mechanical engineering.",
    "design_units": 0,
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Seminars in Mechanical and Aerospace Engineering",
    "units": 1
  },
  {
    "code": 120,
    "corequisites": [],
    "description": "Fundamentals of heat and mass transfer. Conduction, heat and mass transfer by convection in laminar and turbulent flows, radiation heat transfer, and combined modes of heat and mass transfer. Practical engineering applications.",
    "design_units": 0,
    "prerequisites": "ENGRMAE 130B",
    "section": "ENGRMAE",
    "title": "Heat and Mass Transfer",
    "units": 4
  },
  {
    "code": 193,
    "corequisites": [],
    "description": "Provides early-stage design/hands-on experience for upper-division students, and allows them to participate in senior design projects course ENGRMAE 189.",
    "design_units": 1,
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Topics in MAE Design",
    "units": "1-4"
  },
  {
    "code": 299,
    "corequisites": [],
    "description": "Individual research or investigation under the direction of an individual faculty member.",
    "design_units": 0,
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Individual Research",
    "units": "1-16"
  },
  {
    "code": 195,
    "corequisites": [],
    "description": "Seminars by individual faculty in major fields of interest. Materials fee.",
    "design_units": "1-4",
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Seminars in Engineering",
    "units": "1-4"
  },
  {
    "code": 198,
    "corequisites": [],
    "description": "Group study of selected topics in Aerospace and Mechanical Engineering.",
    "design_units": "1-4",
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Group Study",
    "units": "1-4"
  },
  {
    "code": 199,
    "corequisites": [],
    "description": "For undergraduate Engineering majors in supervised but independent reading, research, or design. Students taking individual study for design credit are to submit a written paper to the instructor and to the Undergraduate Student Affairs Office in the School of Engineering.",
    "design_units": "1-4",
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Individual Study",
    "units": "1-4"
  },
  {
    "code": "199P",
    "corequisites": [],
    "description": "For undergraduate Engineering majors in supervised but independent reading, research, or design. Students taking individual study for design are to submit a written paper to the instructor and to the Undergraduate Student Affairs Office in the School of Engineering.",
    "design_units": "1-4",
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Individual Study",
    "units": "1-4"
  },
  {
    "code": 136,
    "corequisites": [],
    "description": "Analysis of flow over aircraft wings and airfoils, prediction of lift, moment, and drag. Topics: fluid dynamics equations; flow similitude; viscous effects; vorticity, circulation, Kelvin's theorem, potential flow; superposition principle, Kutta-Joukowski theorem; thin airfoil theory; finite wing theory; compressibility.",
    "design_units": 1,
    "prerequisites": "ENGRMAE 130B",
    "section": "ENGRMAE",
    "title": "Aerodynamics",
    "units": 4
  },
  {
    "code": "200A",
    "corequisites": [],
    "description": "Linear algebra, including vector spaces, matrices, linear systems of equations, least squares, and the eigenvalue problem. Ordinary differential equations, including analytical and numerical solution methods, stability, and phase portraits.",
    "design_units": 0,
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Engineering Analysis I",
    "units": 4
  },
  {
    "code": "200B",
    "corequisites": [],
    "description": "Review of ordinary differential equations, including Bessel and Legendre functions. Partial differential equations, including the diffusion equation, Laplace's equation, and the wave equation. Fourier series, Fourier and Laplace transforms and their applications.",
    "design_units": 0,
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Engineering Analysis II",
    "units": 4
  },
  {
    "code": 205,
    "corequisites": [],
    "description": "Asymptotic Expansions of integrals. Regular and singular perturbations. Perturbation methods for ordinary and partial differential equations. Matched asymptotic expansions. Multiple-scale asymptotic expansion schemes. Not offered every year.",
    "design_units": 0,
    "prerequisites": "ENGRMAE 200A and ENGRMAE 200B. Knowledge of linear differential equations.",
    "section": "ENGRMAE",
    "title": "Perturbation Methods in Engineering",
    "units": 4
  },
  {
    "code": 206,
    "corequisites": [],
    "description": "Numerical methods for constrained and unconstrained optimization. Necessary and sufficient conditions for optimimality. Conjugate gradient, variable metric algorithms. Gradient projection, penalty functions, and Lagrange methods. Not offered every year.",
    "design_units": 0,
    "prerequisites": "ENGRMAE 200A",
    "section": "ENGRMAE",
    "title": "Nonlinear Optimization Methods",
    "units": 4
  },
  {
    "code": 207,
    "corequisites": [],
    "description": "Unified introduction to finite volume, finite element, field-boundary element, meshless, primal, dual, and mixed methods. Nonlinear problems posed by ordinary as well as partial differential equations. Computer implementations and comparisons of accuracy and convergence.",
    "design_units": 0,
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Methods of Computer Modeling in Engineering and the Sciences",
    "units": 4
  },
  {
    "code": "209P",
    "corequisites": [],
    "description": "Principles, design, operation of energy efficient technology in the built environment, including solar energy, green building design, low waste/emissions construction materials, energy harvesting, built environment energy conversion and storage, high efficiency lighting, daylighting, heat pumps, cooling systems, renewable power systems.",
    "design_units": 0,
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Energy Efficiency Technology",
    "units": 4
  },
  {
    "code": 93,
    "corequisites": [],
    "description": "Early-stage design/hands-on experience for students, and allows them to participate alongside seniors in the design project.",
    "design_units": 1,
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Topics in Design Project",
    "units": "1-4"
  },
  {
    "code": 210,
    "corequisites": [],
    "description": "Premixed, nonpremixed, and heterogenous reactions, with emphasis on kinetics, thermal ignition, turbulent flame propogation, detonations, explosions, flammability limits, diffusion flame, quenching, flame stabilization, and particle and spray combustion. Not offered every year.",
    "design_units": 0,
    "prerequisites": "ENGRMAE 224 or ENGRMAE 230B",
    "section": "ENGRMAE",
    "title": "Advanced Fundamentals of Combustion",
    "units": 4
  },
  {
    "code": "211P",
    "corequisites": [],
    "description": "Basic principles, design, and operation of energy storage systems and technology including lithium ion battery systems for transportation and stationary applications, for flow batteries (e.g., vanadium redox, sodium sulfur), and for reversible fuel cell electrolyzer systems and hydrogen energy storage.",
    "design_units": 0,
    "prerequisites": "Required: Undergraduate-level knowledge of applied engineering thermodynamics.",
    "section": "ENGRMAE",
    "title": "Energy Storage Systems and Technology",
    "units": 4
  },
  {
    "code": 212,
    "corequisites": [],
    "description": "Introduction to engineering electrochemistry fundamentals and applications. Examine thermodynamics and transport principles in typical electrochemical systems. Electrochemical sensors, batteries, fuel cells, and supercapacitors. Manufacturing aspects will also be covered.",
    "design_units": 0,
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Engineering Electrochemistry: Fundamentals and Applications",
    "units": 4
  },
  {
    "code": "212P",
    "corequisites": [],
    "description": "Introduction to engineering electrochemistry fundamentals and applications. Examine thermodynamics and transport principles in typical electrochemical systems. Electrochemical sensors, batteries, fuel cells, and supercapacitors. Manufacturing aspects are also covered.",
    "design_units": 0,
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Engineering Electrochemistry: Fundamentals and Applications",
    "units": 4
  },
  {
    "code": 213,
    "corequisites": [],
    "description": "Space propulsion requirements and maneuvers, stressing those best suited to electric propulsion. An introduction to plasma physics. Electrothermal, electromagnetic and electrostatic accelerators, with emphasis in technologies (ion engines, Hall thrusters and colloidal thrusters) belonging to the latter family.",
    "design_units": 0,
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Electric Propulsion",
    "units": 4
  },
  {
    "code": "214A",
    "corequisites": [],
    "description": "Introduction to electrochemistry and electrocatalysis; nature of fuel-cell electrodes and electrolytes; charge transfer reactions at interfaces; charge transport and mass transport processes; fuel processing reactions; determination of fuel cell efficiency, fuel flexibility, emissions and other characteristics.",
    "design_units": 0,
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Fuel Cell Fundamentals and Technology",
    "units": 4
  },
  {
    "code": "214AP",
    "corequisites": [],
    "description": "Introduction to electrochemistry and electrocatalysis; nature of fuel-cell electrodes and electrolytes; charge transfer reactions at interfaces; charge transport and mass transport processes; fuel processing reactions; determination of fuel cell efficiency, fuel flexibility, emissions, and other characteristics.",
    "design_units": 0,
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Fuel Cell Fundamentals and Technology",
    "units": 4
  },
  {
    "code": "214B",
    "corequisites": [],
    "description": "Fuel cell systems design; impacts of operating conditions; experimental and theoretical analysis methods for fuel cells systems; introduction to degradation mechanisms and mitigation techniques; provides broad insight into fuel-cell science, technology, system design and operation.  Offered every other year.",
    "design_units": 0,
    "prerequisites": "ENGRMAE 214A",
    "section": "ENGRMAE",
    "title": "Fuel Cell Systems and Degradation",
    "units": 4
  },
  {
    "code": "214C",
    "corequisites": [],
    "description": "An in-depth introduction to the fundamentals of PEM fuel cells, including thermodynamics, kinetics, and transport in electrochemical systems. Topics of specific interest to mechanical engineers will include water/heat management and dynamic responses.",
    "design_units": 0,
    "prerequisites": "ENGRMAE 214A",
    "section": "ENGRMAE",
    "title": "PEM Fuel Cells",
    "units": 4
  },
  {
    "code": 119,
    "corequisites": [],
    "description": "Focuses on carbon neutrality and climate stability, addressing.",
    "design_units": 0,
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Climate Solutions",
    "units": 4
  },
  {
    "code": 215,
    "corequisites": [],
    "description": "Pollutant formation and experimental methods. Formation of gaseous pollutants and soot; transformation and emission of fuel contaminants in gas, liquid, and solid fuel combustion; methods employed to measure velocity, turbulence intensity, temperature, composition, particle size; methods to visualize reacting flows.",
    "design_units": 0,
    "prerequisites": "ENGRMAE 200A and (ENGRMAE 230A or ENGRMAE 270A)",
    "section": "ENGRMAE",
    "title": "Advanced Combustion Technology",
    "units": 4
  },
  {
    "code": 216,
    "corequisites": [],
    "description": "Statistics of independent particles, development of quantum mechanical description of atoms and molecules, application of quantum mechanics, evaluation of thermodynamics properties for solids, liquids, and gases, statistical mechanics of dependent particles (ensembles).",
    "design_units": 0,
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Statistical Thermodynamics",
    "units": 4
  },
  {
    "code": 210,
    "corequisites": [],
    "description": "Premixed, nonpremixed, and heterogenous reactions, with emphasis on kinetics, thermal ignition, turbulent flame propogation, detonations, explosions, flammability limits, diffusion flame, quenching, flame stabilization, and particle and spray combustion. Not offered every year.",
    "design_units": 0,
    "prerequisites": "ENGRMAE 224 or ENGRMAE 230B",
    "section": "ENGRMAE",
    "title": "Advanced Fundamentals of Combustion",
    "units": 4
  },
  {
    "code": "218P",
    "corequisites": [],
    "description": "Basic principles, design, and operation of sustainable energy systems including wind, solar photo-voltaic and thermal, hydroelectric, geothermal, oceanic, biomass combustion, advanced coal, and next generation nuclear. Includes power generation, storage, and transmission for stationary power generation.",
    "design_units": 0,
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Sustainable Energy Systems",
    "units": 4
  },
  {
    "code": 145,
    "corequisites": [],
    "description": "Presents the basic mathematical theory of machines. Focuses on the principles of cam design, gearing and gear train analysis, and the kinematic and dynamic analysis of linkages, together with an introduction to robotics.",
    "design_units": 2,
    "prerequisites": "ENGRMAE 52 and (ENGRMAE 80 or ENGRCEE 80 or ENGR 80) and (MATH 3A or I&C SCI 6N)",
    "section": "ENGRMAE",
    "title": "Theory of Machines and Mechanisms",
    "units": 4
  },
  {
    "code": 277,
    "corequisites": [],
    "description": "Supervised learning for classification and regression: perceptrons, support vector machines, feed-forward neural networks, Gaussian processes. Generalization and model selection: cross-validation, regularization, and Bayesian methods. Unsupervised learning: clustering and dimensionality reduction. Learning control systems. Introduction to reinforcement learning.",
    "design_units": 0,
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Learning Control Systems",
    "units": 4
  },
  {
    "code": 189,
    "corequisites": [],
    "description": "Group or individual senior project of theoretical or applied nature involving design. Materials fee.",
    "design_units": "1-4",
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Senior Project - Special Topics",
    "units": "1-4"
  },
  {
    "code": "229P",
    "corequisites": [],
    "description": "Introduction to design and synthesis of nanomaterials. Topics include thermal and liquid transport in materials systems, phase change heat transfer physics, and mechanical properties in materials systems.",
    "design_units": 0,
    "prerequisites": "Required: Undergraduate-level knowledge of heat transfer.",
    "section": "ENGRMAE",
    "title": "Nanoscale Materials for Modern Electronics",
    "units": 4
  },
  {
    "code": 297,
    "corequisites": [],
    "description": "Individual research or investigation conducted in the pursuit of preparing and completing the dissertation required for the Ph.D. in Engineering.",
    "design_units": 0,
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Doctor of Philosophy Dissertation Research",
    "units": "1-16"
  },
  {
    "code": 213,
    "corequisites": [],
    "description": "Space propulsion requirements and maneuvers, stressing those best suited to electric propulsion. An introduction to plasma physics. Electrothermal, electromagnetic and electrostatic accelerators, with emphasis in technologies (ion engines, Hall thrusters and colloidal thrusters) belonging to the latter family.",
    "design_units": 0,
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Electric Propulsion",
    "units": 4
  },
  {
    "code": "212P",
    "corequisites": [],
    "description": "Introduction to engineering electrochemistry fundamentals and applications. Examine thermodynamics and transport principles in typical electrochemical systems. Electrochemical sensors, batteries, fuel cells, and supercapacitors. Manufacturing aspects are also covered.",
    "design_units": 0,
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Engineering Electrochemistry: Fundamentals and Applications",
    "units": 4
  },
  {
    "code": 275,
    "corequisites": [],
    "description": "Advanced tools for feedback control system analysis and synthesis. Norms, operators, Lp spaces, contraction mapping theorem, Lyapunov techniques along with their extensions. Circle criterion positivity and passivity. Applications to nonlinear control methods, such as sliding mode or adaptive techniques.",
    "design_units": 0,
    "prerequisites": "ENGRMAE 270B",
    "section": "ENGRMAE",
    "title": "Nonlinear Feedback Systems",
    "units": 4
  },
  {
    "code": 278,
    "corequisites": [],
    "description": "Bayesian and frequentist approaches to parameter and state estimation. Properties of estimators. Linear Gaussian systems and the Kalman Filter. Nonlinear state estimation, extended and unscented Kalman Filters. Introduction to Monte Carlo methods and particle filtering. Application to tracking and navigation.",
    "design_units": 0,
    "prerequisites": "ENGRMAE 200A and ENGRMAE 270A",
    "section": "ENGRMAE",
    "title": "Parameter and State Estimation",
    "units": 4
  },
  {
    "code": 193,
    "corequisites": [],
    "description": "Provides early-stage design/hands-on experience for upper-division students, and allows them to participate in senior design projects course ENGRMAE 189.",
    "design_units": 1,
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Topics in MAE Design",
    "units": "1-4"
  },
  {
    "code": "270B",
    "corequisites": [],
    "description": "Advanced topics in linear systems: bases, linear operator representations, and Jordan forms. Review of dynamical systems, and stability. Time-varying systems, discrete-time representations, and multi-input/multi-output systems. Introduction to continuous and discrete time linear regulator (LQR) problems. Not offered every year.",
    "design_units": 0,
    "prerequisites": "ENGRMAE 270A",
    "section": "ENGRMAE",
    "title": "Linear Systems II",
    "units": 4
  },
  {
    "code": 221,
    "corequisites": [],
    "description": "Laminar and turbulent convective heat and mass transfer in external and internal flows. Forced and free convection.  Exact and approximate solutions. Similarity solutions.  Variable properties. Concentration boundary layer theory.  Mass transfer conductance.",
    "design_units": 0,
    "prerequisites": "ENGRMAE 230B",
    "section": "ENGRMAE",
    "title": "Convective Heat and Mass Transfer",
    "units": 4
  },
  {
    "code": 245,
    "corequisites": [],
    "description": "Fundamental kinematic theory required for planar, spherical, and spatial mechanism design. The focus is on algebraic methods for the exact solution of constraint equations. Not offered every year.",
    "design_units": 0,
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Spatial Mechanism Design",
    "units": 4
  },
  {
    "code": 152,
    "corequisites": [],
    "description": "Elements and principles of computer-aided engineering with modern hardware and software are presented with a design focus. Case studies are used to assist in finite-element method techniques. Not offered every year.",
    "design_units": 2,
    "prerequisites": "(ENGRMAE 150 or ENGR 150) and ENGRMAE 120",
    "section": "ENGRMAE",
    "title": "Introduction to Computer-Aided Engineering",
    "units": 4
  },
  {
    "code": 195,
    "corequisites": [],
    "description": "Seminars by individual faculty in major fields of interest. Materials fee.",
    "design_units": "1-4",
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Seminars in Engineering",
    "units": "1-4"
  },
  {
    "code": "209P",
    "corequisites": [],
    "description": "Principles, design, operation of energy efficient technology in the built environment, including solar energy, green building design, low waste/emissions construction materials, energy harvesting, built environment energy conversion and storage, high efficiency lighting, daylighting, heat pumps, cooling systems, renewable power systems.",
    "design_units": 0,
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Energy Efficiency Technology",
    "units": 4
  },
  {
    "code": "219P",
    "corequisites": [],
    "description": "Basic principles, design, and operation of solar and other renewable energy systems including solar photo-voltaic, solar thermal, wind, and PEM fuel cell. Includes power generation and storage, and renewable fuels for transportation and stationary power generation.",
    "design_units": 0,
    "prerequisites": "Required: Knowledge of applied engineering thermodynamics.",
    "section": "ENGRMAE",
    "title": "Solar and Renewable Energy Systems",
    "units": 4
  },
  {
    "code": 151,
    "corequisites": "ENGRMAE 170",
    "description": "A comprehensive group design project experience that involves identifying customer needs, idea generation, reverse engineering, preliminary design, standards, prototype development, testing, analysis, and redesign of a product involving fluid, thermal, and mechanical components.  Introduces design for manufacturing and the environment. Materials fee.",
    "design_units": 3,
    "prerequisites": "ENGRMAE 120 and ENGRMAE 145",
    "section": "ENGRMAE",
    "title": "Mechanical Engineering Design",
    "units": 4
  },
  {
    "code": 106,
    "corequisites": [],
    "description": "Experiments in linear systems, including op-amp circuits, vibrations, and control systems. Emphasis on demonstrating that mathematical models can be useful tools for the analysis and design of electro-mechanical systems.  Materials fee.",
    "design_units": 2,
    "prerequisites": "ENGRMAE 60 or EECS 70A",
    "section": "ENGRMAE",
    "title": "Mechanical Systems Laboratory",
    "units": 4
  },
  {
    "code": 239,
    "corequisites": [],
    "description": "Unsteady potential flow modeling (Kelvin's circulation theorem, unsteady Bernoulli's equation). Theodorsen's frequency response, Wagner's step response, and the Kussner sharp-edged gust. State Space approximations for Unsteady Loads. Vortex Lattice. Flutter.",
    "design_units": 0,
    "prerequisites": "ENGRMAE 230A is recommended.",
    "section": "ENGRMAE",
    "title": "Dynamics of Unsteady Flows",
    "units": 4
  },
  {
    "code": 255,
    "corequisites": [],
    "description": "Motivation for composite materials. Different classifications according to the nature of the matrix (PMC, MMC, CMC) and the reinforcement topology (fibers, whiskers, particulates). Mechanical properties. Failure mechanisms. Designing with composite materials. Advantages and limitations of homogenization techniques for numerical modeling.",
    "design_units": 0,
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Composite Materials and Structures",
    "units": 4
  },
  {
    "code": 118,
    "corequisites": [],
    "description": "Basic principles, design, and operation of sustainable energy systems including wind, solar photo-voltaic and thermal, hydroelectric, geothermal, oceanic, biomass combustion, advanced coal, and next generation nuclear. Includes power generation, storage, and transmission for stationary power generation.",
    "design_units": 1,
    "prerequisites": "ENGRMAE 115",
    "section": "ENGRMAE",
    "title": "Sustainable Energy Systems",
    "units": 4
  },
  {
    "code": 272,
    "corequisites": [],
    "description": "Methods for control design of systems with uncertainty. Feedback stability and small gain theorem. Multivariable stability margins and multiplier theory. H-infinity-optimal control, linear matrix inequalities. Not offered every year.",
    "design_units": 0,
    "prerequisites": "ENGRMAE 270A",
    "section": "ENGRMAE",
    "title": "Robust Control Theory",
    "units": 4
  },
  {
    "code": 247,
    "corequisites": [],
    "description": "Covers the fundamentals of the many disciplines needed for design of Micro-Electro-Mechanical Systems (MEMS): microfabrication technology, structural mechanics on micro-scale, electrostatics, circuit interface, control, computer-aided design, and system integration.",
    "design_units": 0,
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Micro-System Design",
    "units": 4
  },
  {
    "code": 256,
    "corequisites": [],
    "description": "Nanoscale materials and the experimental and computational techniques used to measure their properties.  Mechanical behavior is the main focus, but other material properties such as diffusion and electron transport are discussed.",
    "design_units": 0,
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Nanomechanics",
    "units": 4
  },
  {
    "code": 228,
    "corequisites": [],
    "description": "Discusses a wide range of phase change processes (i.e., evaporation, boiling, condensation, and freezing) through the use of novel thermal metamaterials with the aim of enhancing phase change performances.",
    "design_units": 0,
    "prerequisites": "Undergraduate-level heat transfer is recommended.",
    "section": "ENGRMAE",
    "title": "Nanoscale Phase Change Transport Physics",
    "units": 4
  },
  {
    "code": "230B",
    "corequisites": [],
    "description": "Review of mass, momentum, energy equations. Stress tensor, constitutive relations. Laminar flows. Stokes and Oseen flows. Self-similarity. Boundary layer theory: thin-layer approximation, Falkner-Skan, Blasius solutions, integral methods. Jet, wake, cavity flows. Introduction to turbulence: instability, Reynolds averaging, mixing length.",
    "design_units": 0,
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Viscous Incompressible Fluid Mechanics II",
    "units": 4
  },
  {
    "code": 299,
    "corequisites": [],
    "description": "Individual research or investigation under the direction of an individual faculty member.",
    "design_units": 0,
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Individual Research",
    "units": "1-16"
  },
  {
    "code": "214A",
    "corequisites": [],
    "description": "Introduction to electrochemistry and electrocatalysis; nature of fuel-cell electrodes and electrolytes; charge transfer reactions at interfaces; charge transport and mass transport processes; fuel processing reactions; determination of fuel cell efficiency, fuel flexibility, emissions and other characteristics.",
    "design_units": 0,
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Fuel Cell Fundamentals and Technology",
    "units": 4
  },
  {
    "code": 238,
    "corequisites": [],
    "description": "Concepts and techniques for measurement of fluid motion. Quantitative and qualitative flow visualization. Flow facilities, shadowgraph, schlieren, interferometer, thermal anemometer. Laser diagnostics, fluorescence, Rayleigh, Raman, Mie scattering. Laser-Doppler, particle-image, and image- correlation velocimetry. Three- and four-dimensional digital imaging.",
    "design_units": 0,
    "prerequisites": "ENGRMAE 230A and ENGRMAE 230B",
    "section": "ENGRMAE",
    "title": "Experimental Fluid Dynamics",
    "units": 4
  },
  {
    "code": "257P",
    "corequisites": [],
    "description": "Introduction to nanoscale materials and experimental and computational techniques. Topics materials synthesis techniques, thin film deposition, nanoparticle and nanowire growth, characterization with electrons and X-rays, forces and surface interactions at the nanoscale, structure-property scaling laws, and atomistic/multiscale computer modeling.",
    "design_units": 0,
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Fabrication and Characterization of Nanomaterials",
    "units": 4
  },
  {
    "code": 294,
    "corequisites": [],
    "description": "Tutorial in which masters-level students taking the comprehensive examination option undertake a masters-level research project.",
    "design_units": 0,
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Master of Science Thesis Project",
    "units": 4
  },
  {
    "code": 298,
    "corequisites": [],
    "description": "Presentation of advanced topics and reports of current research efforts in mechanical engineering. Required of all graduate students in mechanical engineering.",
    "design_units": 0,
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Seminars in Mechanical and Aerospace Engineering",
    "units": 1
  },
  {
    "code": "217P",
    "corequisites": [],
    "description": "Generalized thermodynamics develops the laws of continuum thermodynamics from a set of plausible and intuitive postulates. The postulates are motivated qualitatively by a statistical description of matter and are justified by a posterior success for the resulting theory.",
    "design_units": 0,
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Generalized Thermodynamics",
    "units": 4
  },
  {
    "code": 146,
    "corequisites": [],
    "description": "Motion in gravitational force fields, orbit transfers, rocketry, interplanetary trajectories, attitude dynamics and stabilization, navigation, reentry, the space environment.",
    "design_units": 1,
    "prerequisites": "ENGRMAE 80 or ENGRCEE 80 or ENGR 80",
    "section": "ENGRMAE",
    "title": "Astronautics",
    "units": 4
  },
  {
    "code": 107,
    "corequisites": "ENGRMAE 120",
    "description": "Fluid and thermal engineering laboratory. Experimental analysis of fluid flow, heat transfer, and thermodynamic systems. Probability, statistics, and uncertainly analysis. Report writing is emphasized and a design project is required. Materials fee.",
    "design_units": 1,
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Fluid Thermal Science Laboratory",
    "units": 4
  },
  {
    "code": 207,
    "corequisites": [],
    "description": "Unified introduction to finite volume, finite element, field-boundary element, meshless, primal, dual, and mixed methods. Nonlinear problems posed by ordinary as well as partial differential equations. Computer implementations and comparisons of accuracy and convergence.",
    "design_units": 0,
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Methods of Computer Modeling in Engineering and the Sciences",
    "units": 4
  },
  {
    "code": 175,
    "corequisites": [],
    "description": "Equations of motion, linearization, stability derivatives, and longitudinal and lateral modes of motion. Handling qualities, sensors and actuators, and effects of various feedbacks on stability and performance. Stability augmentation. Autopilot design.",
    "design_units": 3,
    "prerequisites": "ENGRMAE 106",
    "section": "ENGRMAE",
    "title": "Dynamics and Control of Aerospace Vehicles",
    "units": 4
  },
  {
    "code": "230D",
    "corequisites": [],
    "description": "Well-posed problems and boundary, initial, and interface conditions; strong and weak solutions. Similarity, perturbation theory and limit behavior, bifurcations. Dispersive and nondispersive wave propagation, acoustics, ship waves, internal gravity waves, water waves. Vortices: mutual interactions and stability. Jets, wakes, cavities.",
    "design_units": 0,
    "prerequisites": "ENGRMAE 230A and ENGRMAE 230B",
    "section": "ENGRMAE",
    "title": "Theoretical Foundations of Fluid Mechanics",
    "units": 4
  },
  {
    "code": 205,
    "corequisites": [],
    "description": "Asymptotic Expansions of integrals. Regular and singular perturbations. Perturbation methods for ordinary and partial differential equations. Matched asymptotic expansions. Multiple-scale asymptotic expansion schemes. Not offered every year.",
    "design_units": 0,
    "prerequisites": "ENGRMAE 200A and ENGRMAE 200B. Knowledge of linear differential equations.",
    "section": "ENGRMAE",
    "title": "Perturbation Methods in Engineering",
    "units": 4
  },
  {
    "code": 296,
    "corequisites": [],
    "description": "Individual research or investigation conducted in the pursuit of preparing and completing the thesis required for the M.S. in Engineering.",
    "design_units": 0,
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Master of Science Thesis Research",
    "units": "1-16"
  },
  {
    "code": 258,
    "corequisites": [],
    "description": "Presents a continuum, macroscopic view of deformation and failure of solids. Covers elasticity, plasticity, visco-elasticity, visco-plasticity, fracture and fatigue. Topics include discussions of physical behavior, mathematical formalism and measurement techniques.",
    "design_units": 0,
    "prerequisites": "ENGRMAE 254",
    "section": "ENGRMAE",
    "title": "Mechanical Behavior of Solids - Continuum Theories",
    "units": 4
  },
  {
    "code": 220,
    "corequisites": [],
    "description": "Steady state and transient conduction heat transfer in one- and multi-dimensional geometries. Analytical methods, exact and approximate. Numerical techniques are also included.",
    "design_units": 0,
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Conduction Heat Transfer",
    "units": 4
  },
  {
    "code": 117,
    "corequisites": [],
    "description": "Basic principles, design, and operation of solar and other renewable energy systems including solar photo-voltaic, solar thermal, wind, and PEM fuel cell. Includes power generation and storage, and renewable fuels for transportation and stationary power generation.",
    "design_units": 1,
    "prerequisites": "(ENGRMAE 91 or CBE 40B)",
    "section": "ENGRMAE",
    "title": "Solar and Renewable Energy Systems",
    "units": 4
  },
  {
    "code": 217,
    "corequisites": [],
    "description": "Generalized thermodynamics develops the laws of continuum thermodynamics from a set of plausible and intuitive postulates. The postulates are motivated qualitatively by a statistical description of matter and are justified by a posterior success for the resulting theory.",
    "design_units": 0,
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Generalized Thermodynamics",
    "units": 4
  },
  {
    "code": 279,
    "corequisites": [],
    "description": "Selected topics of current interest in mechanical systems. Topics include robotics, kinematics, control, dynamics, and geometric modeling.",
    "design_units": 0,
    "prerequisites": "ENGRMAE 270A and ENGRMAE 241",
    "section": "ENGRMAE",
    "title": "Special Topics in Mechanical Systems",
    "units": 4
  },
  {
    "code": 52,
    "corequisites": [],
    "description": "Develops skills for interpretation and presentation of mechanical design drawings and the use of CAD in engineering design. An integrated approach to drafting based on sketching, manual drawing, and three-dimensional CAD techniques is presented.",
    "design_units": "0.5",
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Computer-Aided Design",
    "units": 4
  },
  {
    "code": 244,
    "corequisites": [],
    "description": "Spatial rigid body kinematics is presented with applications to robotics. Orthogonal Matrices, Rodrigues' formula, Quaternions, Plucker coordinates, screw theory, and dual numbers are studied using modern projective geometry and multi-linear algebra. Applications include trajectory planning, inverse kinematics, and workspace analysis.",
    "design_units": 0,
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Theoretical Kinematics",
    "units": 4
  },
  {
    "code": 153,
    "corequisites": [],
    "description": "Introduction to BIOMEMS. Advanced biotechnology/biomedicine equipment based on MEMS and NEMS. Fundamentals of MEMS/NEMS sensing techniques and the biological and physics principles involved and the preferred MEMS and NEMS manufacturing techniques.",
    "design_units": 0,
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Advanced BIOMEMS Manufacturing Techniques",
    "units": 4
  },
  {
    "code": 184,
    "corequisites": [],
    "description": "Review of statistics as applied to experimental research. Fundamentals and principles of statistical experimental design and analysis with emphasis on understanding and use of designed experiments, response surfaces, linear regression modeling, and process optimization.",
    "design_units": 1,
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Fundamentals of Experimental Design",
    "units": 4
  },
  {
    "code": 222,
    "corequisites": [],
    "description": "Black body radiation.  Radiative transport equations for surfaces separated by non-participating media.  Radiant energy transfer through absorbing, emitting, and scattering media. Radiation-conduction interaction.  Radiation-convection interaction.  Introduction to finite-difference solutions.",
    "design_units": 0,
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Radiative Heat Transfer",
    "units": 4
  },
  {
    "code": "247P",
    "corequisites": [],
    "description": "Covers the fundamentals of the many disciplines needed for design of Micro-Electro-Mechanical Systems (MEMS): microfabrication technology, structural mechanics on micro-scale, electrostatics, circuit interface, control, computer-aided design, and system integration.",
    "design_units": 0,
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Micro-System Design",
    "units": 4
  },
  {
    "code": 164,
    "corequisites": [],
    "description": "Sources, dispersion, and effects of air pollutants. Topics include emission factors, emission inventory, air pollution, meteorology, air chemistry, air quality modeling, impact assessment, source and ambient monitoring, regional control strategies.",
    "design_units": 2,
    "prerequisites": "(ENGRMAE 91 or CBE 40B) and ENGRMAE 130A",
    "section": "ENGRMAE",
    "title": "Air Pollution and Control",
    "units": 4
  },
  {
    "code": "214C",
    "corequisites": [],
    "description": "An in-depth introduction to the fundamentals of PEM fuel cells, including thermodynamics, kinetics, and transport in electrochemical systems. Topics of specific interest to mechanical engineers will include water/heat management and dynamic responses.",
    "design_units": 0,
    "prerequisites": "ENGRMAE 214A",
    "section": "ENGRMAE",
    "title": "PEM Fuel Cells",
    "units": 4
  },
  {
    "code": "199P",
    "corequisites": [],
    "description": "For undergraduate Engineering majors in supervised but independent reading, research, or design. Students taking individual study for design are to submit a written paper to the instructor and to the Undergraduate Student Affairs Office in the School of Engineering.",
    "design_units": "1-4",
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Individual Study",
    "units": "1-4"
  },
  {
    "code": 10,
    "corequisites": "MATH 2A",
    "description": "Introduction to the solution of engineering problems through the use of the computer. Elementary programming, numerical analysis, and data visualization with a high-level programming language such as MATLAB.",
    "design_units": 1,
    "prerequisites": "MATH 2A or MATH 5A",
    "section": "ENGRMAE",
    "title": "Introduction to Engineering Computations",
    "units": 4
  },
  {
    "code": "223B",
    "corequisites": [],
    "description": "Introduction to turbulence. Reynolds-averaging of Navier-Stokes equations. Second-order closure of the average equations. Use of two-dimensional elliptic procedure to predict confined turbulent flows. Not offered every year.",
    "design_units": 0,
    "prerequisites": "ENGRMAE 223A",
    "section": "ENGRMAE",
    "title": "Numerical Methods in Heat, Mass, and Momentum II",
    "units": 4
  },
  {
    "code": 170,
    "corequisites": [],
    "description": "Feedback control systems. Modeling, stability, and systems specifications. Root locus, Nyquist, and Bode methods of analysis and design.",
    "design_units": 2,
    "prerequisites": "(ENGRMAE 80 or ENGRCEE 80 or ENGR 80) and ENGRMAE 106",
    "section": "ENGRMAE",
    "title": "Introduction to Control Systems",
    "units": 4
  },
  {
    "code": 183,
    "corequisites": [],
    "description": "Focuses on design of planar, spherical, and spatial mechanisms using computer algebra and graphics. Topics include exact and approximate analytical design techniques. Students are required to use existing software (or develop new algorithms) to design various mechanisms for new applications.",
    "design_units": 4,
    "prerequisites": "MATH 3A or I&C SCI 6N",
    "section": "ENGRMAE",
    "title": "Computer-Aided Mechanism Design",
    "units": 4
  },
  {
    "code": 231,
    "corequisites": [],
    "description": "Phenomenon of turbulence. Reynolds equations. Dynamics of turbulence. Free turbulent shear flows. Wall-bounded turbulent shear flows. Turbulent transport of scalar quantities. Spectral dynamics. Mathematical models of turbulence.",
    "design_units": 0,
    "prerequisites": "ENGRMAE 230A and ENGRMAE 230B",
    "section": "ENGRMAE",
    "title": "Fundamentals of Turbulence",
    "units": 4
  },
  {
    "code": 108,
    "corequisites": [],
    "description": "Analytical and experimental investigation in aerodynamics, fluid dynamics, and heat transfer. Emphasis on study of flow over objects and lift and drag on airfoils. Introduction to basic diagnostic techniques. Report writing is emphasized. Design project is required.",
    "design_units": 2,
    "prerequisites": "ENGRMAE 130B",
    "section": "ENGRMAE",
    "title": "Aerospace Laboratory",
    "units": 4
  },
  {
    "code": 237,
    "corequisites": [],
    "description": "Mathematical, physical, and computational fundamentals of computational fluid dynamics, numerical methods for solving the Euler and Navier-Stokes equations. Topics include: finite-difference and finite-volume discretization, time marching methods, von Neumann analysis, upwinding, flux splitting, TVD, and other high-resolution shock-capturing schemes.",
    "design_units": 0,
    "prerequisites": "ENGRMAE 230C",
    "section": "ENGRMAE",
    "title": "Computational Fluid Dynamics",
    "units": 4
  },
  {
    "code": "230C",
    "corequisites": [],
    "description": "One-dimensional unsteady flow; Riemann invariants, acoustics, shock tube. Two-dimensional flow: shock polars, linear theory, similarity rules, method of characteristics. Three dimensional flow: slender-body theory.  Effects of viscosity and conductivity:  laminar boundary layer, Crocco-Busemann relations.",
    "design_units": 0,
    "prerequisites": "ENGRMAE 230A or ENGRMAE 230B",
    "section": "ENGRMAE",
    "title": "Compressible Fluid Dynamics",
    "units": 4
  },
  {
    "code": 259,
    "corequisites": [],
    "description": "Presents atomistic mechanisms that control mechanical behavior of materials. Covers plasticity, dislocation theory, strengthening mechanisms, high-temperature diffusion and gain boundary sliding, shear localization, void formation, ductile rupture, brittle fracture and fatigue.",
    "design_units": 0,
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Mechanical Behavior of Solids - Atomistic Theories",
    "units": 4
  },
  {
    "code": 198,
    "corequisites": [],
    "description": "Group study of selected topics in Aerospace and Mechanical Engineering.",
    "design_units": "1-4",
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Group Study",
    "units": "1-4"
  },
  {
    "code": 218,
    "corequisites": [],
    "description": "Basic principles, design and operation of sustainable energy systems including wind, solar photo-voltaic and thermal, hydroelectric, geothermal, oceanic, biomass combustion, advanced coal and next generation nuclear.  Includes power generation, storage, and transmission for stationary power generation.",
    "design_units": 0,
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Sustainable Energy Systems",
    "units": 4
  },
  {
    "code": "252P",
    "corequisites": [],
    "description": "Introduces engineering and science students to the science of miniaturization. Different options to make very small machines (micro and nano size) are reviewed, materials choices are discussed, scaling laws are analyzed, and many practical applications are listed.",
    "design_units": 0,
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Fundamentals of Microfabrication",
    "units": 4
  },
  {
    "code": "200B",
    "corequisites": [],
    "description": "Review of ordinary differential equations, including Bessel and Legendre functions. Partial differential equations, including the diffusion equation, Laplace's equation, and the wave equation. Fourier series, Fourier and Laplace transforms and their applications.",
    "design_units": 0,
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Engineering Analysis II",
    "units": 4
  },
  {
    "code": 284,
    "corequisites": [],
    "description": "Fundamentals and principles of statistical experimental design and analysis. Emphasis addresses understanding and use of designed experiments, response surfaces, linear regression modeling, process optimization, and development of links between empirical and theoretical models.",
    "design_units": 0,
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Fundamentals of Experimental Design",
    "units": 4
  },
  {
    "code": "295P",
    "corequisites": [],
    "description": "Studies in selected areas of Mechanical and Aerospace Engineering. Topics addressed vary each quarter.",
    "design_units": 0,
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Special Topics in Mechanical and Aerospace Engineering",
    "units": 4
  },
  {
    "code": 260,
    "corequisites": [],
    "description": "Current issues related to the atmosphere, climate, and air quality in the context of energy conversion and sustainability. Topics include transportation systems; building design; impacts on humans and ecosystems; modeling and meteorology; economics; and application to public policies.",
    "design_units": 0,
    "prerequisites": "ENGRMAE 261 or CHEM 245 or EARTHSS 240",
    "section": "ENGRMAE",
    "title": "Current Issues Related to Air Quality, Climate, and Energy",
    "units": 4
  },
  {
    "code": 199,
    "corequisites": [],
    "description": "For undergraduate Engineering majors in supervised but independent reading, research, or design. Students taking individual study for design credit are to submit a written paper to the instructor and to the Undergraduate Student Affairs Office in the School of Engineering.",
    "design_units": "1-4",
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Individual Study",
    "units": "1-4"
  },
  {
    "code": 159,
    "corequisites": [],
    "description": "Preliminary design of subsonic general aviation and transport aircraft with emphasis on layout, aerodynamic design, propulsion, and performance. Estimation of total weight and weight distribution, design of wings, fuselage, and tail, selection and location of engines, prediction of overall performance.",
    "design_units": 4,
    "prerequisites": "ENGRMAE 112 and ENGRMAE 136 and ENGRMAE 158",
    "section": "ENGRMAE",
    "title": "Aircraft Design",
    "units": 4
  },
  {
    "code": 254,
    "corequisites": [],
    "description": "Finite deformation kinematics; stress and strain measures; invariance in solid mechanics; objective rates; constitutive theory of elastic and inelastic solids; rate formulations; computational approaches; theories of plates and shells; applications to aerospace vehicles.",
    "design_units": 0,
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Mechanics of Solids and Structures",
    "units": 4
  },
  {
    "code": "270A",
    "corequisites": [],
    "description": "Input-output and state-space representations of continuous-time linear systems. State transition matrices,  Controllability and observability. Irreducible realizations.  State feedback and observer design.",
    "design_units": 0,
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Linear Systems I",
    "units": 4
  },
  {
    "code": 216,
    "corequisites": [],
    "description": "Statistics of independent particles, development of quantum mechanical description of atoms and molecules, application of quantum mechanics, evaluation of thermodynamics properties for solids, liquids, and gases, statistical mechanics of dependent particles (ensembles).",
    "design_units": 0,
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Statistical Thermodynamics",
    "units": 4
  },
  {
    "code": 241,
    "corequisites": [],
    "description": "Kinematics and dynamics of three-dimensional motions. Lagrange's equations, Newton-Euler equations. Applications include robot systems and spinning satellites.",
    "design_units": 0,
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Dynamics",
    "units": 4
  },
  {
    "code": 252,
    "corequisites": [],
    "description": "Introduces Engineering and Science students to the science of miniaturization. Different options to make very small machines (micro and nano size) are reviewed, materials choices are discussed, scaling laws are analyzed, and many practical applications are listed.",
    "design_units": 0,
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Fundamentals of Microfabrication",
    "units": 4
  },
  {
    "code": 182,
    "corequisites": [],
    "description": "Fundamental principles necessary to understand statistical learning methods. Introduction to the R programming language. Mathematical foundation for various machine learning algorithms. Computer implementation.",
    "design_units": 0,
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Introduction to Machine Learning",
    "units": 4
  },
  {
    "code": 188,
    "corequisites": [],
    "description": "Principles of engineering design in the context of an industrial application. Local manufacturing firms define an engineering design project to be completed in 10 weeks. Projects include initial brainstorming to final design, with a formal presentation.",
    "design_units": 4,
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Engineering Design in Industry",
    "units": 4
  },
  {
    "code": 80,
    "corequisites": [],
    "description": "Introduction to the kinematics and dynamics of particles and rigid bodies. The Newton-Euler, Work/Energy, and Impulse/Momentum methods are explored for ascertaining the dynamics of particles and rigid bodies. An engineering design problem using these fundamental principles is also undertaken.",
    "design_units": "0.5",
    "prerequisites": "MATH 2D and PHYSICS 7C",
    "section": "ENGRMAE",
    "title": "Dynamics",
    "units": 4
  },
  {
    "code": 147,
    "corequisites": [],
    "description": "Analysis of structural vibrations of mechanical systems. Modeling for lumped and distributed parameter systems. Topics include single and multi-degree of freedom systems, free and forced vibrations, Fourier series, convolution integral, mass/stiffness matrices, and normal modes with design project.",
    "design_units": 1,
    "prerequisites": "(ENGR 80 or ENGRCEE 80 or ENGRMAE 80) and MATH 2E and MATH 3D",
    "section": "ENGRMAE",
    "title": "Vibrations",
    "units": 4
  },
  {
    "code": 233,
    "corequisites": [],
    "description": "Practical and theoretical aspects of turbulent free shear flows. Instability, global scaling laws, mixing, and noise generation in incompressible and compressible shear layers, jets, and wakes. Kelvin-Helmholtz instability, near- and far-field growth rates, effect of compressibility, aeroacoustics of jets.",
    "design_units": 0,
    "prerequisites": "ENGRMAE 200B and ENGRMAE 230A and ENGRMAE 230B",
    "section": "ENGRMAE",
    "title": "Turbulent Free Shear Flows",
    "units": 4
  },
  {
    "code": 110,
    "corequisites": [],
    "description": "Fundamentals of gaseous, liquid, and coal-fired combustion and fuel cell systems. Fuels, fuel-air mixing, aerodynamics, and combustion and fuel cell thermodynamics. Operating and design aspects of practical systems including engines, power generators, boilers, furnaces, and incinerators.",
    "design_units": 2,
    "prerequisites": "ENGRMAE 115",
    "section": "ENGRMAE",
    "title": "Combustion and Fuel Cell Systems",
    "units": 4
  },
  {
    "code": 171,
    "corequisites": [],
    "description": "Methods for analysis and design of discrete-time control systems. Z-transforms, difference equations, discrete Fourier transforms. Sampling theorem and applications.  Z-plane stability, frequency response. Digital controller design. Introduction to digital filters.",
    "design_units": 2,
    "prerequisites": "ENGRMAE 170",
    "section": "ENGRMAE",
    "title": "Digital Control Systems",
    "units": 4
  },
  {
    "code": "214B",
    "corequisites": [],
    "description": "Fuel cell systems design; impacts of operating conditions; experimental and theoretical analysis methods for fuel cells systems; introduction to degradation mechanisms and mitigation techniques; provides broad insight into fuel-cell science, technology, system design and operation.  Offered every other year.",
    "design_units": 0,
    "prerequisites": "ENGRMAE 214A",
    "section": "ENGRMAE",
    "title": "Fuel Cell Systems and Degradation",
    "units": 4
  },
  {
    "code": 155,
    "corequisites": [],
    "description": "Motivation for composite materials. Different classifications according to the nature of the matrix (PMC, MMC, CMC) and the reinforcement topology (fibers, whiskers, particulates).  Mechanical properties. Failure mechanisms. Designing with composite materials. Advantages and limitations of homogenization techniques for numerical modeling.",
    "design_units": 0,
    "prerequisites": "ENGR 54 and (ENGRMAE 150 or ENGRCEE 150 or ENGR 150)",
    "section": "ENGRMAE",
    "title": "Composite Materials and Structures",
    "units": 4
  },
  {
    "code": 52,
    "corequisites": [],
    "description": "Develops skills for interpretation and presentation of mechanical design drawings and the use of CAD in engineering design. An integrated approach to drafting based on sketching, manual drawing, and three-dimensional CAD techniques is presented.",
    "design_units": "0.5",
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Computer-Aided Design",
    "units": 4
  },
  {
    "code": "254P",
    "corequisites": [],
    "description": "Finite deformation kinematics; stress and strain measures; invariance in solid mechanics; objective rates; constitutive theory of elastic and inelastic solids; rate formulations; computational approaches; theories of plates and shells; applications to aerospace vehicles.",
    "design_units": 0,
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Mechanics of Solids and Structures",
    "units": 4
  },
  {
    "code": 115,
    "corequisites": [],
    "description": "Application of thermodynamic principles to compressible and incompressible processes representative of practical engineering problems; power cycles, refrigeration cycles, multicomponent mixtures, air conditioning systems, combustion, and compressible flow. Design of a thermodynamic process.",
    "design_units": 2,
    "prerequisites": "ENGRMAE 91 or CBE 40B or ENGRMSE 65A",
    "section": "ENGRMAE",
    "title": "Applied Engineering Thermodynamics",
    "units": 4
  },
  {
    "code": 280,
    "corequisites": [],
    "description": "The basic aspects of mechatronic design are covered, including motor and sensor selection, control strategies, finite state machines, inertial measurement units, and implementation of advanced feedback control laws. Students work in groups to create their own mechatronic device. Materials fee.",
    "design_units": 0,
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Design of Computer-Controlled Robots",
    "units": 4
  },
  {
    "code": 172,
    "corequisites": "ENGRMAE 60",
    "description": "Students design a small robotic device and program it to exhibit sentient behaviors. The basic aspects of mechatronic design are covered, including motor and sensor selection, control strategies, and microcomputer programming for the implementation of control paradigms.  Materials fee.",
    "design_units": 3,
    "prerequisites": "ENGRMAE 170",
    "section": "ENGRMAE",
    "title": "Design of Computer-Controlled Robots",
    "units": 4
  },
  {
    "code": 227,
    "corequisites": [],
    "description": "Heat transfer and thermal resistance analysis relevant for microdevices and nanomaterials. Overview of recent progress in nanotechnology and materials science. Thermal modeling strategies for novel electronic devices and energy conversion systems.",
    "design_units": 0,
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Thermal Resistance Analysis in Microdevices and Nanomaterials",
    "units": 4
  },
  {
    "code": "259P",
    "corequisites": [],
    "description": "Presents atomistic mechanisms that control mechanical behavior of materials. Covers plasticity, dislocation theory, strengthening mechanisms, high-temperature diffusion and gain boundary sliding, shear localization, void formation, ductile rupture, brittle fracture, and fatigue.",
    "design_units": 0,
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Mechanical Behavior of Solids - Atomistic Theories",
    "units": 4
  },
  {
    "code": 91,
    "corequisites": [],
    "description": "Thermodynamic principles; open and closed systems representative of engineering problems. First and second law of thermodynamics with applications to engineering systems and design.",
    "design_units": "0.5",
    "prerequisites": "PHYSICS 7C and MATH 2D",
    "section": "ENGRMAE",
    "title": "Introduction to Thermodynamics",
    "units": 4
  },
  {
    "code": 224,
    "corequisites": [],
    "description": "Fundamentals of transport phenomena in fluid (gas and liquid), solid, and nano systems. Conservation equations, fundamentals of diffusion, ion transport, dispersion in turbulent/laminar flows, absorption, differential/staged distillation, transport in membranes, and nano/microscale transport phenomena. Not offered every year.",
    "design_units": 0,
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Advanced Transport Phenomena",
    "units": 4
  },
  {
    "code": "150L",
    "corequisites": "ENGRMAE 150",
    "description": "Experimental techniques for the measurement of mechanical properties of materials and structures. Methods for load, displacement, and strain measurements. Tension, bending, compression tests. Determination of strength, stiffness, toughness for metals, polymers, ceramics, and composites. Deformation of structures. Materials fee.",
    "design_units": 0,
    "prerequisites": "ENGRMAE 30 or ENGR 30 or ENGRCEE 30",
    "section": "ENGRMAE",
    "title": "Mechanics of Structures Laboratory",
    "units": 1
  },
  {
    "code": 158,
    "corequisites": [],
    "description": "Flight theory applied to subsonic propeller and jet aircraft. Nature of aerodynamic forces, drag and lift of wing and fuselage, high-lift devices, level-flight performance, climb and glide performance, range, endurance, take-off and landing distances, static and dynamic stability and control.",
    "design_units": 2,
    "prerequisites": "ENGRMAE 130A",
    "section": "ENGRMAE",
    "title": "Aircraft Performance",
    "units": 4
  },
  {
    "code": 114,
    "corequisites": [],
    "description": "Introduction to electrochemistry and electrocatalysis; nature of fuel-cell electrodes and electrolytes; charge transfer reactions at interfaces; charge transport and mass transport processes; fuel processing reactions; determination of fuel cell efficiency, fuel flexibility, emissions, and other characteristics.",
    "design_units": 0,
    "prerequisites": "ENGRMAE 115",
    "section": "ENGRMAE",
    "title": "Fuel Cell Fundamentals and Technology",
    "units": 4
  },
  {
    "code": 157,
    "corequisites": [],
    "description": "Fundamentals of torsion and bending. Analysis and design of thin-wall and composite beams. Stress analysis of aircraft components. Stiffness, strength, and buckling. Introduction to the Finite Element method and its application to plates and shells.",
    "design_units": 2,
    "prerequisites": "ENGR 150 or ENGRCEE 150 or ENGRMAE 150",
    "section": "ENGRMAE",
    "title": "Lightweight Structures",
    "units": 4
  },
  {
    "code": 185,
    "corequisites": [],
    "description": "Solution of mechanical-engineering equations by means of numerical methods. Errors in numerical analysis. Nonlinear equation and sets of equations. Numerical differentiation and integration. Ordinary differential equations. Boundary-value problems. Partial differential equations.",
    "design_units": 2,
    "prerequisites": "(ENGRMAE 10 or EECS 10 or EECS 12 or BME 60B) and MATH 3D and MATH 2E",
    "section": "ENGRMAE",
    "title": "Numerical Analysis in Mechanical Engineering",
    "units": 4
  },
  {
    "code": 226,
    "corequisites": [],
    "description": "Special topics of current interest in fluid mechanics, heat and mass transfer, multiphase flows, or combustion. Emphasis could be placed on theory, computational methods, or experimental techniques.",
    "design_units": 0,
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Special Topics in Fluid and Thermal Sciences",
    "units": "1-4"
  },
  {
    "code": 57,
    "corequisites": [],
    "description": "With laboratory. Machines and processes of mechanical manufacturing. Safety and professional procedures emphasized.  Use of measuring instruments, hand tools, lathe, mill, drill press, bandsaw, grinder, welding equipment.",
    "design_units": 0,
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Manufacturing Processes in Engineering",
    "units": 2
  },
  {
    "code": 60,
    "corequisites": "MATH 3D",
    "description": "Design and analysis of analog circuits based on lumped circuit elements with emphasis on the use of operational amplifiers. Sinusoidal and transient response. Constructional and laboratory testing of analog circuits, and introduction to data acquisition. Materials fee.",
    "design_units": 2,
    "prerequisites": "PHYSICS 7D and PHYSICS 7LD",
    "section": "ENGRMAE",
    "title": "Electric Circuits",
    "units": 4
  },
  {
    "code": 206,
    "corequisites": [],
    "description": "Numerical methods for constrained and unconstrained optimization. Necessary and sufficient conditions for optimimality. Conjugate gradient, variable metric algorithms. Gradient projection, penalty functions, and Lagrange methods. Not offered every year.",
    "design_units": 0,
    "prerequisites": "ENGRMAE 200A",
    "section": "ENGRMAE",
    "title": "Nonlinear Optimization Methods",
    "units": 4
  },
  {
    "code": 242,
    "corequisites": [],
    "description": "Spatial rigid-body transformations.  Forward and inverse kinematics. Jacobian of serial and parallel chains.  Screw coordinates and transformations. Rate and static analyses using screw theory. Singularity analysis. Trajectory generation. Not offered every year.",
    "design_units": 0,
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Robotics",
    "units": 4
  },
  {
    "code": 112,
    "corequisites": [],
    "description": "Application of thermodynamics and fluid mechanics to basic flow processes and cycle performance in propulsion systems: gas turbines, ramjets, scramjets, and rockets.",
    "design_units": 1,
    "prerequisites": "ENGRMAE 135",
    "section": "ENGRMAE",
    "title": "Propulsion",
    "units": 4
  },
  {
    "code": 250,
    "corequisites": [],
    "description": "Sensors, actuators, and neural circuits for biological movement control from an engineering perspective.  Current approaches to robotic and mechatronic devices that support and enhance human movement in health and following neurologic injuries like stroke and spinal cord injury.",
    "design_units": 0,
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Biorobotics",
    "units": 4
  },
  {
    "code": "223A",
    "corequisites": [],
    "description": "Introduction to the discretization of various types of partial differential equations (parabolic, elliptic, hyperbolic). Finite-volume discretization for one- and two-dimensional flows. Use of a two-dimensional elliptic procedure to predict sample laminar flows.",
    "design_units": 0,
    "prerequisites": "or corequisite: ENGRMAE 230A",
    "section": "ENGRMAE",
    "title": "Numerical Methods in Heat, Mass, and Momentum Transport (Laminar Flows) I",
    "units": 4
  },
  {
    "code": 249,
    "corequisites": [],
    "description": "Introduction to the technology of Micro-Electro-Mechanical Systems (MEMS). Fundamental principles and applications of important microsensors, actuation principles on microscale.  Introduction to the elements of signal processing; processing of materials for micro sensor/actuator fabrication; smart sensors and microsensor/microactuator array devices.",
    "design_units": 0,
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Micro-Sensors and Actuators",
    "units": 4
  },
  {
    "code": 30,
    "corequisites": "MATH 2D",
    "description": "Addition and resolution of forces, distributed forces, equivalent system of forces centroids, first moments, moments and products on inertia, equilibrium of rigid bodies, trusses, beams, cables.  Course may be offered online.",
    "design_units": 0,
    "prerequisites": "MATH 2D and PHYSICS 7C",
    "section": "ENGRMAE",
    "title": "Statics",
    "units": 4
  },
  {
    "code": 57,
    "corequisites": [],
    "description": "With laboratory. Machines and processes of mechanical manufacturing. Safety and professional procedures emphasized.  Use of measuring instruments, hand tools, lathe, mill, drill press, bandsaw, grinder, welding equipment.",
    "design_units": 0,
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Manufacturing Processes in Engineering",
    "units": 2
  },
  {
    "code": 253,
    "corequisites": [],
    "description": "Introduction to BIOMEMS. Advanced biotechnology/biomedicine equipment based on MEMS and NEMS. Fundamentals of MEMS/NEMS sensing techniques and the biological and physics principles involved and the preferred MEMS and NEMS manufacturing techniques.",
    "design_units": 0,
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Advanced BIOMEMS Manufacturing Techniques",
    "units": 4
  },
  {
    "code": 295,
    "corequisites": [],
    "description": "Special topics by individual faculty in major fields of interest.",
    "design_units": 0,
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Special Topics in Mechanical and Aerospace Engineering",
    "units": "1-4"
  },
  {
    "code": 10,
    "corequisites": "MATH 2A",
    "description": "Introduction to the solution of engineering problems through the use of the computer. Elementary programming, numerical analysis, and data visualization with a high-level programming language such as MATLAB.",
    "design_units": 1,
    "prerequisites": "MATH 2A or MATH 5A",
    "section": "ENGRMAE",
    "title": "Introduction to Engineering Computations",
    "units": 4
  },
  {
    "code": 156,
    "corequisites": [],
    "description": "Principles governing structure and mechanical behavior of materials, relationship relating microstructure and mechanical response with application to elasticity, plasticity, yielding, necking, creep, and fracture of materials. Introduction to experimental techniques to characterize the properties of materials. Design parameters.",
    "design_units": 2,
    "prerequisites": "ENGR 54",
    "section": "ENGRMAE",
    "title": "Mechanical Behavior and Design Principles",
    "units": 4
  },
  {
    "code": 215,
    "corequisites": [],
    "description": "Pollutant formation and experimental methods. Formation of gaseous pollutants and soot; transformation and emission of fuel contaminants in gas, liquid, and solid fuel combustion; methods employed to measure velocity, turbulence intensity, temperature, composition, particle size; methods to visualize reacting flows.",
    "design_units": 0,
    "prerequisites": "ENGRMAE 200A and (ENGRMAE 230A or ENGRMAE 270A)",
    "section": "ENGRMAE",
    "title": "Advanced Combustion Technology",
    "units": 4
  },
  {
    "code": "214AP",
    "corequisites": [],
    "description": "Introduction to electrochemistry and electrocatalysis; nature of fuel-cell electrodes and electrolytes; charge transfer reactions at interfaces; charge transport and mass transport processes; fuel processing reactions; determination of fuel cell efficiency, fuel flexibility, emissions, and other characteristics.",
    "design_units": 0,
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Fuel Cell Fundamentals and Technology",
    "units": 4
  },
  {
    "code": 276,
    "corequisites": [],
    "description": "Using the mathematics of differential geometry, a number of the concepts and results of linear systems theory have been extended to nonlinear systems. Describes these extensions and illustrate their use in nonlinear system analysis and design. Not offered every year.",
    "design_units": 0,
    "prerequisites": "ENGRMAE 200A and ENGRMAE 270A",
    "section": "ENGRMAE",
    "title": "Geometric Nonlinear Control",
    "units": 4
  },
  {
    "code": 30,
    "corequisites": "MATH 2D",
    "description": "Addition and resolution of forces, distributed forces, equivalent system of forces centroids, first moments, moments and products on inertia, equilibrium of rigid bodies, trusses, beams, cables.  Course may be offered online.",
    "design_units": 0,
    "prerequisites": "MATH 2D and PHYSICS 7C",
    "section": "ENGRMAE",
    "title": "Statics",
    "units": 4
  },
  {
    "code": 274,
    "corequisites": [],
    "description": "Principles and methods of optimal control. Topics include objectives and issues in controlling nonlinear systems; linear variational and adjoint equations; optimality conditions via variational calculus, maximum principle, and dynamic programming; solution methods; applications to control robots and aerospace vehicles.",
    "design_units": 0,
    "prerequisites": "ENGRMAE 200A and ENGRMAE 270A",
    "section": "ENGRMAE",
    "title": "Optimal Control",
    "units": 4
  },
  {
    "code": 150,
    "corequisites": [],
    "description": "Stresses and strains. Torsion. Bending. Beam deflection.  Shear force and moment distributions in beams. Yielding and buckling of columns. Combined loading. Transformation of stresses and strain. Yielding criteria. Finite elements analysis of frames. Dynamic of two-bar truss.",
    "design_units": 2,
    "prerequisites": "(ENGRCEE 30 or ENGR 30 or ENGRMAE 30) and MATH 3A",
    "section": "ENGRMAE",
    "title": "Mechanics of Structures",
    "units": 4
  },
  {
    "code": "230A",
    "corequisites": [],
    "description": "Equations of motion. Vector notation. Flow kinematics. Potential flow and complex potential. Vorticity and circulation. Bernoulli's theorem. Crocco's theorem. Conformal, Joukowski, and Schwarz-Christoffel transformations.",
    "design_units": 0,
    "prerequisites": [],
    "section": "ENGRMAE",
    "title": "Inviscid Incompressible Fluid Mechanics I",
    "units": 4
  },
  {
    "code": "211P",
    "corequisites": [],
    "description": "Basic principles, design, and operation of energy storage systems and technology including lithium ion battery systems for transportation and stationary applications, for flow batteries (e.g., vanadium redox, sodium sulfur), and for reversible fuel cell electrolyzer systems and hydrogen energy storage.",
    "design_units": 0,
    "prerequisites": "Required: Undergraduate-level knowledge of applied engineering thermodynamics.",
    "section": "ENGRMAE",
    "title": "Energy Storage Systems and Technology",
    "units": 4
  },
  {
    "code": 60,
    "corequisites": "MATH 3D",
    "description": "Design and analysis of analog circuits based on lumped circuit elements with emphasis on the use of operational amplifiers. Sinusoidal and transient response. Constructional and laboratory testing of analog circuits, and introduction to data acquisition. Materials fee.",
    "design_units": 2,
    "prerequisites": "PHYSICS 7D and PHYSICS 7LD",
    "section": "ENGRMAE",
    "title": "Electric Circuits",
    "units": 4
  },
  {
    "code": 113,
    "corequisites": [],
    "description": "Space propulsion requirements and maneuvers, stressing those best suited to electric propulsion. An introduction to plasma physics. Electrothermal, electromagnetic, and electrostatis accelerators, with emphasis in technologies (ion engines, Hall thrusters, and colloidal thrusters) belonging to the latter family.",
    "design_units": 1,
    "prerequisites": "ENGRMAE 112",
    "section": "ENGRMAE",
    "title": "Electric Propulsion",
    "units": 4
  }
]